{
    "10421": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "Students learn the fundamentals of audio electronics with an emphasis on mixed-signal techniques (combined analog and digital processing circuitry) for real-time systems. This is an advanced course providing extensive lab time for the design of audio systems employing amplifiers, filters, analog-to-digital converters, digital signal processors, and digital-to-analog converters",
        "equivalent": 10421,
        "full_name": "Audio Elecronics",
        "id": 10421,
        "lexographic": 2,
        "num": "9826T0",
        "online": false,
        "online_only": false,
        "prereq_string": "Accelerated Analog Electronics or Accelerated Digital Electronics or Advanced Microprocessor Systems",
        "prereqs": [
            [
                "10426"
            ],
            [
                "10427"
            ],
            [
                "10422"
            ]
        ],
        "semester": true,
        "short_name": "Audio Electronics",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10422": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "Students learn the fundamentals of microprocessor electronics with an emphasis on system development. Extensive lab time is provided for the design of intermediate and advanced microprocessor circuitry and associated machine-language programming. This course complements computer science courses by providing extensive hands-on experience with the electronic hardware.",
        "equivalent": 10422,
        "full_name": "Advanced Microprocessor Sys",
        "id": 10422,
        "lexographic": 1,
        "num": "9826T1",
        "online": false,
        "online_only": false,
        "prereq_string": "Accelerated Analog Electronics or Accelerated Digital Electronics",
        "prereqs": [
            [
                "10426"
            ],
            [
                "10427"
            ]
        ],
        "semester": true,
        "short_name": "Adv Microproc Sys",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10426": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "Students learn the basics of analog electronics with an emphasis on how to design linear circuitry. This is an introductory course providing beginning-level lab experiences with electronic components, circuit configurations, analysis techniques, and general engineering practices. From this work students gain familiarity and confidence with the basics while developing a range of design skills. Students use what they have learned to design a chain of complex linear circuitry. Together with Digital Electronics, this course provides a strong background for senior projects in many other laboratories as well as the Microelectronics Lab.",
        "equivalent": 10426,
        "full_name": "Accelerated Analog Electronics",
        "id": 10426,
        "lexographic": 0,
        "num": "9826T5",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Acc Analog Elect",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10427": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "Students learn the basics of digital electronics with an emphasis on how to design digital systems. This is an introductory course providing beginning-level lab experiences with digital hardware including gates, encoders, decoders, multiplexers, counters, registers, ALUs, ROMs, RAMs, and interface circuitry. From this work, students develop design skills from simple logic minimization to complex state machine design using PLD synthesis software. Students use what they have learned to design complex digital electronic systems. Together with Analog Electronics, this course provides a strong background for senior projects in many other laboratories as well as the Microelectronics Lab.",
        "equivalent": 10427,
        "full_name": "Accelerated Digital Electronics",
        "id": 10427,
        "lexographic": 0,
        "num": "9826T6",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Acc Digital Elec",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10428": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "This semester course explores closed loop systems that are flexible in nature due to the use of programmable analyzers rather than dedicated electronic circuits. A variety of microcontrollers and sensors are introduced as the backbone of applications involving fixed as well as mobile robot platforms. Fabrication of custom parts is introduced as well as the use of off-the-shelf components to construct solutions to problems such as maze navigation, object recognition, and object manipulation. Terminology, career opportunities, and safety with robotic systems are covered. It is required that students who intend to do a senior research project involving concepts and equipment in the Automation and Robotics Laboratory take at least one Automation and Robotics semester course.",
        "equivalent": 10428,
        "full_name": "Aut/Rob-Micro Sys",
        "id": 10428,
        "lexographic": 0,
        "num": "9826T7",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Aut/Rob-Micro Sys",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10429": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "This semester course explores the building blocks of automated and robotic systems with special emphasis on design and control. The designing of various robots for specific functions as well as the creation of those designs are the focus of the curriculum and the problem solving activities for the course. VEX structural components and electronic controls assembled on breadboards are used to model a variety of automated and robotic devices. Terminology, career opportunities, and safety with automated systems are covered. It is required that students who intend to do a senior research project involving concepts and equipment in the Automation and Robotics Laboratory take at least one Automation and Robotics semester course.",
        "equivalent": 10429,
        "full_name": "Aut/Rob-Systems",
        "id": 10429,
        "lexographic": 0,
        "num": "9826T8",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Aut/Rob-Systems",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10431": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "This course is intended for those students who wish to pursue a career in engineering, industrial design, product design, or manufacturing. This is an introductory course designed to introduce students to a variety of skills and techniques used to design and develop products. Students learn how to safely use and operate basic hand tools and machinery through a series of instructor-led projects. Topics include material properties and processes, precision measurement, basic welding, Computer Aided Design (CAD), and Computer Controlled (CNC) machining.",
        "equivalent": 10431,
        "full_name": "Prototyping 1",
        "id": 10431,
        "lexographic": 0,
        "num": "9828T0",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Prototype Dev 1",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10433": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "The CAD course is the culmination of a long history of graphical representation of the spatial problem-solving process. This is taught within the context of the Autodesk program Inventor. Unlike previous CAD programs such as AutoCAD, Inventor is a parametric CAD program. What that means is the dimensions, shape, and other key factors in the design are controlled by variables which can be changed at any time, even after the design is complete. In effect, when you design an object in a parametric CAD program you are creating not one design but a whole family of related designs. In the simplest example one can draw a hexagonal nut, change two dimensions and a hole parameter and it will become any hexagonal nut. Change another parameter and it will become a square nut. For increased complexity one can design a generic internal combustion engine.",
        "equivalent": 10433,
        "full_name": "Spec Comp Asst Des",
        "id": 10433,
        "lexographic": 0,
        "num": "9828T2",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Spec Comp Asst Des",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10435": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "This course builds upon the knowledge learned in Prototyping 1 by introducing more advanced techniques and open-ended design projects, and aims to prepare students for the Prototyping Research Lab by requiring them to develop and create custom solutions to specific problems. Students will learn how to program and operate advanced Computer Controlled (CNC) machinery such as a CNC mill, lathe, router, and waterjet. Prototyping Development 1 is a pre-requisite for this course.",
        "equivalent": 10435,
        "full_name": "Prototyping 2",
        "id": 10435,
        "lexographic": 1,
        "num": "9828T4",
        "online": false,
        "online_only": false,
        "prereq_string": "Prototyping 1",
        "prereqs": [
            [
                "10431"
            ]
        ],
        "semester": true,
        "short_name": "Prototype Dev 2",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10436": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "We all swim in a technological sea. It is the human habitat. From this perspective the ultimate practical knowledge is engineering. If one has a problem an engineer will design a solution. The engineering profession is the discipline of solving open-ended problems which involve technology in some way. The best known example of this is engineering design. Design in general is imagining and creating something new. Engineering design includes analysis and testing and is specifically directed toward solving problems in technology. This course includes engineering history, patents and inventions, introduction to engineering drawing in CAD, aerodynamics, statics, structural analysis of trusses and beams, scaling and modeling all within the context of engaging realistic projects. Past projects have included designs of sailboats for water, land, or ice, seawall/levee, and several different projectile launching machines (e.g., punkin chunkin)",
        "equivalent": 10436,
        "full_name": "Intro Engr Acc Adv",
        "id": 10436,
        "lexographic": 0,
        "num": "9828T5",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Intro Engr Acc Adv",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10439": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "Alternative Energy Systems (ES2) focuses on the study of topics pertaining to the constantly changing field of energy and its implementation. During the semester students will be working in both classroom and lab settings in the study of basic thermodynamics, future energy systems, alternative methods of powering internal combustion engines, basic fuel cell processes and systems, and alternative vehicle systems. Students are responsible for conducting a low level research project into the field of Energy Systems. This project will be based on topics pertaining to the future of energy systems or alternative methods of utilizing current technologies. This project will facilitate the need for student collaboration with industry for obtainment of supporting materials. The Alternative Energy Systems research project will be the summation of studies in the classroom and will be due at the end of the semester.",
        "equivalent": 10439,
        "full_name": "Energy Systems 2",
        "id": 10439,
        "lexographic": 1,
        "num": "9828T8",
        "online": false,
        "online_only": false,
        "prereq_string": "Energy Systems 1",
        "prereqs": [
            [
                "10440"
            ]
        ],
        "semester": true,
        "short_name": "Energy Systems 2",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10440": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "Conventional Energy Systems (ES1) focuses on the study of topics pertaining to the history and current state of energy and its implementation. During the semester students will be working in both classroom and lab settings in the study of basic thermodynamics, transportation, internal combustion engines, heat and mass transfer, 2nd law analysis, vehicle systems, and power systems. Students are responsible for conducting a low level research project into the field of Energy Systems. This project will be based on topics pertaining to historical or current energy systems and will facilitate the need for student collaboration with industry. The Conventional Energy Systems research project will be the summation of studies in the classroom and will be due at the end of the semester.",
        "equivalent": 10440,
        "full_name": "Energy Systems 1",
        "id": 10440,
        "lexographic": 0,
        "num": "9828T9",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Energy Systems 1",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10441": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            false,
            false
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "The mission of the Design & Technology course is to build competitive excellence by instilling students with technical and scientific literacy to design and engineer creative solutions for a sustainable future. It is the cornerstone course in a Thomas Jefferson student's program of studies and it assigns a high priority to teaming skills. Design & Tech is an integral part of the IBET program whose focus is on the scientific process including experimental design, data collection and analysis, project management and communications. Engineering Design: Students will continually use the engineering design process to generate ideas and discover solutions. Structural, aeronautical and autonomous designs will be created this year. Electronics: Students will understand basic electronic theory and be capable of designing and building a simple circuit to monitor one aspect of the environment. Students will make use of integrated circuits and Picaxe board to create advanced circuits. Prototyping: Students will have the opportunity to gain the knowledge of simple tools as well as power tools. Each student will design, construct, and form various projects that require essential skills in design. Computer Aided Design: Students will be introduced to Autodesk Inventor. They will learn about mechanical drawings, orthographic projections, multi-view drawings. Mechanics/Applied Physics: Students will design (using Inventor) and build a programmable robot. Additional design competitions may be held if time permits. Other Topics: Students will be introduced to the use of statistics, basic sketching, GPS/GIS, and Mathmatica.",
        "equivalent": 10441,
        "full_name": "Design and Tech",
        "id": 10441,
        "lexographic": 0,
        "num": 984060,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Design and Tech",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "10476": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "General",
        "coreq_string": "",
        "description": "The Teachers for Tomorrow course introduces juniors and seniors to a career in teaching and education.  The primary elements of the curriculum foster the students interest in understanding and appreciating the teaching profession, learning the history, structure and governance of teaching and applying professional techniques of teaching during a field experience.  The  field experience may involve the preschool level through 12th grade.",
        "equivalent": 10476,
        "full_name": "Teachers for Tomorrow 1",
        "id": 10476,
        "lexographic": 0,
        "num": 906226,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Teachers Fortmrw1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "10488": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "This course provides leadership training to interested students. It is especially appropriate for student body officers, class officers, activity leaders, and student athletic leaders. Planned discussions, exercises in leadership and development of evaluation skills will be required. Special focus will be placed on organization, management, communication techniques, goal planning, establishing and learning organizational values, and other roles and responsibilities as a leader. Students must submit an application to be considered for this course. This course qualifies for the 4th social studies credit.",
        "equivalent": 10488,
        "full_name": "Ethical Leadership",
        "id": 10488,
        "lexographic": 0,
        "num": "2998T2",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Ethical Leadership",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10595": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            false,
            false
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "Students examine functions and relations, to include quadratics, polynomials, power and square root functions, rational functions, logarithmic and exponential functions, and conics. Students study characteristics of each family of functions, such as graph sketching, transformations, and applications. Introductory linear algebra topics, such as matrices and determinants, are introduced in relation to systems of equations and inequalities. Extensions on basic function topics include factoring techniques and the Binomial Theorem. Emphasis is on modeling, logic, and interpretation of results. The process standard focus will be Problem Solving. Graphing utilities, especially graphing calculators, are integral to the course. Upon completion, students take the Algebra 2 SOL end-of-course test.",
        "equivalent": 10595,
        "full_name": "TJ Math 3",
        "id": 10595,
        "lexographic": 2,
        "num": 313753,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [
            [
                "10598"
            ]
        ],
        "semester": true,
        "short_name": "TJ Math 3",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10597": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            false,
            false,
            false
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "Students will study geometric topics in depth, with a focus on building critical thinking and reasoning skills. Topics of study include inductive and deductive reasoning, understanding logic statements, writing proofs, parallel and perpendicular lines and their properties, congruent triangles and similarity, properties of triangles, quadrilaterals, and circles. The process standard focus will be reasoning.",
        "equivalent": 10597,
        "full_name": "TJ Math 1",
        "id": 10597,
        "lexographic": 0,
        "num": 314351,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "TJ Math 1",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10598": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            false,
            false
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "Students continue the study of geometric topics, with a focus on transitioning to algebraic methods for solving problems. Topics of study include transformations, right triangle trigonometry, area of polygons and circles, surface area and volume, vectors in 2D (including component form and unit vector topics), solving equations and inequalities, linear systems up to 3D, and basic matrix algebra. Use of technology is integrated throughout the course. The process standard focus will be representation. Upon completion of this course, students take the SOL end-of-course test in Geometry.",
        "equivalent": 10598,
        "full_name": "TJ Math 2",
        "id": 10598,
        "lexographic": 1,
        "num": 314352,
        "online": true,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [
            [
                "10597"
            ]
        ],
        "semester": true,
        "short_name": "TJ Math 2",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10600": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            false
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "The study of Advanced Functions includes an extension of topics first introduced in algebra. All parent function graphs and their transformations are a focus as well as the important features of graphs such as symmetry, concavity, extrema and end behavior. Operations on functions are studied, especially composition, and finding appropriate domains is stressed. Specific functions such as exponential and logarithmic are explored and used for graphing, solving equations, and applications. Other topics of study include sequences and series, proof by math induction, and the exploration of conic sections and their applications and an introduction to the fundamentals of calculus, including limits, continuity, and the concept of the derivative. The process standard focus will be Communication. Upon conclusion of TJ Math 5, students will be advised as to which level of AP Calculus they should take the following school year.",
        "equivalent": 10600,
        "full_name": "TJ Math 5",
        "id": 10600,
        "lexographic": 4,
        "num": 316055,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [
            [
                "11344"
            ]
        ],
        "semester": true,
        "short_name": "TJ Math 5",
        "skiptest": true,
        "summer": true,
        "weight": 0.5
    },
    "10602": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            false
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "Students study basic probability and statistics with an emphasis on applications to scientific research. Topics studied include combinatorics, probability, descriptive statistics, and statistical distributions. The course culminates with an introduction to inferential statistics and applications of t-tests. Use of technology is integrated throughout the course.",
        "equivalent": 10602,
        "full_name": "TJ Research Stat 1",
        "id": 10602,
        "lexographic": 0,
        "num": "3190T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "TJ Research Stat 1",
        "skiptest": false,
        "summer": true,
        "weight": 0.5
    },
    "10603": {
        "ap": "post",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "Research Statistics II is an introductory course in descriptive and inferential statistics and basic probability. There are four conceptual themes: (1) Exploring data: observing patterns and departures from patterns, (2) Planning a study: deciding what and how to measure, (3) Anticipating patterns in advance: producing models using probability and simulation, (4) Statistical inference: confirming models. This course includes all of the topics required by the AP Statistics program not covered in Research Statistics I. Students will use statistics as a tool to solve a variety of problems in different areas, including political science, economics, sports, ecology, law, and the biological and physical sciences. Extensive use of the calculator and computer is included. The course emphasizes critical thinking and clear, precise writing. Students who successfully complete the course will be prepared to take the AP Statistics examination.",
        "equivalent": 10603,
        "full_name": "TJ Research Stat 2",
        "id": 10603,
        "lexographic": 0,
        "num": "3190T2",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "TJ Research Stat 2",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "10604": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Computer Science",
        "coreq_string": "",
        "description": "Students develop software solutions by building web apps. Technologies may include a back-end SQL database, web programming in PHP and/or JavaScript, and user-interface design for mobile displays: HTML elements, CSS, tables, the DOM, and cookies. Web server configuration, server-side cookies, Iframes, and sessions may also be covered, as well as page sequencing, including both theory and practice in web services. Development consists of the formal methods of software engineering such as product life-cycle and collaborative organizational structures. Students work in teams and typical activities include both design reviews and code reviews. Emphasis will vary based on projects and industry trends, and accessibility, privacy, security, connectivity, and product audience.",
        "equivalent": 10604,
        "full_name": "Web App Development",
        "id": 10604,
        "lexographic": 2,
        "num": "3199J1",
        "online": false,
        "online_only": false,
        "prereq_string": "AP Computer Science A+ (Data Structures including APCS-A)",
        "prereqs": [
            [
                "6563"
            ]
        ],
        "semester": true,
        "short_name": "Web App Develop",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "10605": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Computer Science",
        "coreq_string": "",
        "description": "Students develop software solutions by building mobile apps, which may include smart phone (Android, ios, and/or windows), tablet, and/or embedded systems. Development consists of user-interface design, a software-based blend of human computer interaction and user-centered design, as well as formal methods of software engineering such as product life-cycle, collaborative organizational structures, and important benchmarks. Students work in teams and typical activities include both design reviews and code reviews. Specific platforms and emphasis will vary based on projects and industry trends, and accessibility, privacy, security, connectivity, and product audience.",
        "equivalent": 10605,
        "full_name": "Mobile App Develop",
        "id": 10605,
        "lexographic": 2,
        "num": "3199J2",
        "online": false,
        "online_only": false,
        "prereq_string": "AP Computer Science A+ (Data Structures including APCS-A)",
        "prereqs": [
            [
                "6563"
            ]
        ],
        "semester": true,
        "short_name": "Mobile App Develop",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "10610": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "This course will provide a firm foundation in probability theory and a brief introduction to statistical applications. A rigorous treatment will be employed in order to properly prepare the student for advanced applications in mathematics, science, and engineering. Topics to be covered include discrete and continuous random variables, probability density and distribution functions, moment generating functions, multidimensional random variables, functions of random variables, and special distributions, such as the binomial, negative binomial, hypergeometric, multinomial, uniform, Gamma, Beta, and especially the normal distribution (including the Central Limit Theorem).",
        "equivalent": 10610,
        "full_name": "Probability Theory",
        "id": 10610,
        "lexographic": 8,
        "num": "3199TA",
        "online": false,
        "online_only": false,
        "prereq_string": "Multivariable Calculus",
        "prereqs": [
            [
                "2204"
            ]
        ],
        "semester": true,
        "short_name": "Probability Theory",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "10611": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "Explore the foundations of computers and programming from a mathematical rather than a programming perspective. In depth look at number systems and computer arithmetic concepts such as base, modulo, n's complement, bit math, and basic cryptography. Counting with combinations and permutations, Stirling numbers of the first and second kind, Catalan numbers. Graph theory topics such as matching, assignments, flow, networks, and searching. Regular expressions, Generating functions, Fibonacci and hypergeometric sequences. Mathematical approach to recursion, state recursion, dynamic programming, and incremental iteration.",
        "equivalent": 10611,
        "full_name": "Concrete Math",
        "id": 10611,
        "lexographic": 8,
        "num": "3199TB",
        "online": false,
        "online_only": false,
        "prereq_string": "Multivariable Calculus",
        "prereqs": [
            [
                "2204"
            ]
        ],
        "semester": true,
        "short_name": "Concrete Math",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "10614": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The level V French class is designed for those advanced students who wish to continue their study of the French language, literature, history, culture and related current global issues. Students will continue to improve their communication skills in all areas acquiring a more sophisticated level of language as well as improved colloquial communication and cultural understanding. The class will be conducted entirely in French and all resources used will be authentic and at an appropriate challenging level in the target language. Films will be used regularly to document selected themes. Each marking period, students will be expected to complete an independent original project related to the theme(s) of study demonstrating their learning and skill development.",
        "equivalent": 10614,
        "full_name": "French 5 Sem 1",
        "id": 10614,
        "lexographic": 5,
        "num": "5150T1",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1427"
            ],
            [
                "1431"
            ]
        ],
        "semester": true,
        "short_name": "French 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10615": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The level V French class is designed for those advanced students who wish to continue their study of the French language, literature, history, culture and related current global issues. Students will continue to improve their communication skills in all areas acquiring a more sophisticated level of language as well as improved colloquial communication and cultural understanding. The class will be conducted entirely in French and all resources used will be authentic and at an appropriate challenging level in the target language. Films will be used regularly to document selected themes. Each marking period, students will be expected to complete an independent original project related to the theme(s) of study demonstrating their learning and skill development.",
        "equivalent": 10615,
        "full_name": "French 5 Sem 2",
        "id": 10615,
        "lexographic": 5,
        "num": "5150T2",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1427"
            ],
            [
                "1431"
            ]
        ],
        "semester": true,
        "short_name": "French 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10617": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The level V German class is designed for those advanced students who wish to continue their study of the German language, literature, history, culture and related current global issues. The course has an interdisciplinary approach, integrating topics and perspectives from STEM-related subjects as well as humanities and arts. tudents will continue to improve their communication skills in all areas, including oral and written communication, and reading, listening, and viewing of authentic resources. Throughout the thematic units, special emphasis is placed on enhancing students’ colloquial communication and cultural competence. The class will be conducted entirely in German and all materials used will be authentic and at an appropriate challenging level in the target language. Students will engage in tasks and activities that are relevant to them and inspire the use of critical and creative thinking skills. Students will be expected to complete quarterly independent original projects on themes of their choice, demonstrating their learning and skill development. Students can also develop leadership skills through a wide variety of opportunities, including initiating new contents and organizing in-class and out-of class cultural events.",
        "equivalent": 10617,
        "full_name": "German 5 Sem 1",
        "id": 10617,
        "lexographic": 5,
        "num": "5250T1",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1443"
            ],
            [
                "1447"
            ]
        ],
        "semester": true,
        "short_name": "German 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10618": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The level V German class is designed for those advanced students who wish to continue their study of the German language, literature, history, culture and related current global issues. The course has an interdisciplinary approach, integrating topics and perspectives from STEM-related subjects as well as humanities and arts. Students will continue to improve their communication skills in all areas, including oral and written communication, and reading, listening, and viewing of authentic resources. Throughout the thematic units, special emphasis is placed on enhancing students’ colloquial communication and cultural competence. The class will be conducted entirely in German and all materials used will be authentic and at an appropriate challenging level in the target language. Students will engage in tasks and activities that are relevant to them and inspire the use of critical and creative thinking skills. Students will be expected to complete quarterly independent original projects on themes of their choice, demonstrating their learning and skill development. Students will also develop leadership skills through a wide variety of opportunities, including initiating new contents and organizing in-class and out-of class cultural events.",
        "equivalent": 10618,
        "full_name": "German 5 Sem 2",
        "id": 10618,
        "lexographic": 5,
        "num": "5250T2",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1443"
            ],
            [
                "1447"
            ]
        ],
        "semester": true,
        "short_name": "German 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10621": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students will study poetry of the late republic and early Augustan age with an emphasis on the late republican poetry of Catullus. The following themes will be covered: love, friendship, familial relationships, marriage, betrayal, death, misogyny, and social mores. The early Augustan age poets, Horace and Ovid, will be read in relation to the above mentioned themes.",
        "equivalent": 10621,
        "full_name": "Latin 5 Sem 1",
        "id": 10621,
        "lexographic": 5,
        "num": "5350T1",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1454"
            ],
            [
                "1456"
            ]
        ],
        "semester": true,
        "short_name": "Latin 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10622": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students will study poetry of the late republic and early empire with an emphasis on the poetry of Ovid and Horace. Relevant poems by Catullus will also be read. Students will analyze poems and discuss the historical, social, and political context of the times. Examples include Catullus’ stinging invectives, Horace’s treatment of Cleopatra, and Ovid’s often-humorous jabs at Augustus. For the 4th quarter, there will be a major group project involving either film or the staging of a Plautine play",
        "equivalent": 10622,
        "full_name": "Latin 5 Sem 2",
        "id": 10622,
        "lexographic": 5,
        "num": "5350T2",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1454"
            ],
            [
                "1456"
            ]
        ],
        "semester": true,
        "short_name": "Latin 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10623": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The level V Russian class is designed for those advanced students who wish to continue their study of the Russian language, literature, history, culture and related current global issues. Students will continue to improve their communication skills in all areas acquiring a more sophisticated level of language as well as improved colloquial communication and cultural understanding. The class will be conducted entirely in Russian and all resources used will be authentic and at an appropriate challenging level in the target language. Students will develop leadership skills through a wide variety of opportunities. Students may be asked to operate on an independent or semi-independent basis. Each marking period, students will be expected to complete an independent original project related to the theme(s) of study demonstrating their learning and skill development.",
        "equivalent": 10623,
        "full_name": "Russian 5 Sem 1",
        "id": 10623,
        "lexographic": 4,
        "num": "5450T1",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1464"
            ],
            [
                "5110"
            ]
        ],
        "semester": true,
        "short_name": "Russian 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10624": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The level V Russian class is designed for those advanced students who wish to continue their study of the Russian language, literature, history, culture and related current global issues. Students will continue to improve their communication skills in all areas acquiring a more sophisticated level of language as well as improved colloquial communication and cultural understanding. The class will be conducted entirely in Russian and all resources used will be authentic and at an appropriate challenging level in the target language. Students will develop leadership skills through a wide variety of opportunities. Students may be asked to operate on an independent or semi-independent basis. Each marking period, students will be expected to complete an independent original project related to the theme(s) of study demonstrating their learning and skill development.",
        "equivalent": 10624,
        "full_name": "Russian 5 Sem 2",
        "id": 10624,
        "lexographic": 4,
        "num": "5450T2",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1464"
            ],
            [
                "5110"
            ]
        ],
        "semester": true,
        "short_name": "Russian 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10626": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The level V Spanish class is designed for those advanced students who wish to continue their study of the Spanish language, literature, history, culture and related current global issues. Students will continue to improve their communication skills in all areas acquiring a more sophisticated level of language as well as improved colloquial communication and cultural understanding. The class will be conducted entirely in Spanish and all resources used will be authentic and at an appropriate challenging level in the target language. Students will develop leadership skills through a wide variety of opportunities. Students may be asked to operate on an independent or semi-independent basis. Each marking period, students will be expected to complete an independent original project related to the theme(s) of study demonstrating their learning and skill development.Themes to be addressed:Social and domestic issues related to living in the target culture with the goal of preparing students for study abroad or student exchange programs.Spanish Dramatic literature and related cultural/historical themes with integrated vocabulary and language skills development. Authors’ works to be studied may include Tirso de Molina, Lope de Vega, Buero Vallejo, Galdós, Alejandro Casona and García Lorca.Current global issues with a focus on cause and effect, regarding such issues as the European economic crisis, economic and social development in Latin America, the relationship between politics, culture, poverty and immigration.Using Spanish in your chosen profession, travel, community service and in education.",
        "equivalent": 10626,
        "full_name": "Spanish 5 Sem 1",
        "id": 10626,
        "lexographic": 5,
        "num": "5550T1",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1477"
            ],
            [
                "1481"
            ]
        ],
        "semester": true,
        "short_name": "Spanish 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10627": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The level V Spanish class is designed for those advanced students who wish to continue their study of the Spanish language, literature, history, culture and related current global issues. Students will continue to improve their communication skills in all areas acquiring a more sophisticated level of language as well as improved colloquial communication and cultural understanding. The class will be conducted entirely in Spanish and all resources used will be authentic and at an appropriate challenging level in the target language. Students will develop leadership skills through a wide variety of opportunities. Students may be asked to operate on an independent or semi-independent basis. Each marking period, students will be expected to complete an independent original project related to the theme(s) of study demonstrating their learning and skill development. Themes to be addressed:Historical themes and their relevance to current issues and culture. Popular stories, fables and proverbs as a reflection of history, culture and values.Music, fine arts and architecture as it reflects Hispanic history and culture.Use of Spanish in the “real world”: careers, volunteer work and study abroad.Current colloquial language and pop culture as presented in Television news, “sit coms” and soap operas.Literature and film as a way of understanding history & culture",
        "equivalent": 10627,
        "full_name": "Spanish 5 Sem 2",
        "id": 10627,
        "lexographic": 5,
        "num": "5550T2",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1477"
            ],
            [
                "1481"
            ]
        ],
        "semester": true,
        "short_name": "Spanish 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10628": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop more sophisticated communication skills in all four areas listening, speaking, reading and writing with emphasis on the ability to interact orally and in writing. The authentic reading selections are emphasized at this level. Students communicate using more complex language structures and express abstract ideas with reasonable fluency. Students are able to create and listen with understanding to reports and presentations. They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
        "equivalent": 10628,
        "full_name": "Chinese 5 Sem 1",
        "id": 10628,
        "lexographic": 5,
        "num": "5850T1",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "5149"
            ],
            [
                "2221"
            ]
        ],
        "semester": true,
        "short_name": "Chinese 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10629": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop more sophisticated communication skills in all four areas listening, speaking, reading and writing with emphasis on the ability to interact orally and in writing. The authentic reading selections are emphasized at this level. Students communicate using more complex language structures and express abstract ideas with reasonable fluency. Students are able to create and listen with understanding to reports and presentations. They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
        "equivalent": 10629,
        "full_name": "Chinese 5 Sem 2",
        "id": 10629,
        "lexographic": 5,
        "num": "5850T2",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "5149"
            ],
            [
                "2221"
            ]
        ],
        "semester": true,
        "short_name": "Chinese 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10630": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The level V Japanese class is designed for those advanced students who wish to continue their study of the Japanese language, culture, history, and related current global issues. The students will engage further skill development and acquisition of cultural knowledge through various readings and research projects that are customized to the individual interests and needs. The course is conducted in the combined class environment with the AP Japanese class. The students will set individual or group goals for each quarter upon teacher-student conference session. These goal objectives will be accomplished in independent or semi-independent basis. The course will be conducted predominantly in the target language. The focus topics will be: Historical events and figures that influenced the society in Japan.  Study of the Japanese POP culture and its influence to the global community. Creative writing and poetry that reflects the Japanese culture. Inventions, discoveries, and adaptations that changed the lifestyle of the people in Japan.",
        "equivalent": 10630,
        "full_name": "Japanese 5 Sem 1",
        "id": 10630,
        "lexographic": 5,
        "num": "5950T1",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1527"
            ],
            [
                "2220"
            ]
        ],
        "semester": true,
        "short_name": "Japanese 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10631": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The level V Japanese class is designed for those advanced students who wish to continue their study of the Japanese language, culture, history, and related current global issues. The students will engage further skill development and acquisition of cultural knowledge through various readings and research projects that are customized to the individual interests and needs. The course is conducted in the combined class environment with the AP Japanese class. The students will set individual or group goals for each quarter upon teacher-student conference session. These goal objectives will be accomplished in independent or semi-independent basis. The course will be conducted predominantly in the target language. The focus topics will be:Current issues and challenges that Japan faces such as natural resources, aging society, natural and human disasters. The history of immigration started the end of the 19th century when Japan ended 270 years of national isolation.Study of colloquial language both in writing and oral communication through manga and anime.Textbooks:Adventure in Japanese Volume 3 and 4;Kanji Book volume 1 and 2;Japanese Graded Readers;Other appropriate reading materials for the selected study themes.Website: Web Japan (http://web-japan.org/);Meguro Language Center (http://www.mlcjapanese.co.jp/); Other appropriate resource sites",
        "equivalent": 10631,
        "full_name": "Japanese 5 Sem 2",
        "id": 10631,
        "lexographic": 5,
        "num": "5950T2",
        "online": false,
        "online_only": false,
        "prereq_string": "(Language) 4, or Advanced Placement Language, or equivalency test",
        "prereqs": [
            [
                "1527"
            ],
            [
                "2220"
            ]
        ],
        "semester": true,
        "short_name": "Japanese 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10646": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "This course is designed for students who want to learn new skills in design and drawing and understand the use of spatial concepts including overlapping, foreground, middle ground and background, linear perspective, scale, atmospheric perspective, aerial perspective, that will assist with engineering projects. Also the use of vector-based software such as Adobe illustrator and photo shop to create digital illustrative designs, graphic designs, and typography can assist with building overall design skills.",
        "equivalent": 10646,
        "full_name": "Art for Engineers",
        "id": 10646,
        "lexographic": 0,
        "num": "9153T0",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Art for Engineers",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "10650": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Technology & Engineering Education",
        "coreq_string": "",
        "description": "Engineering Design is a high school level elective course. In Engineering Design students are introduced to common approaches to solve engineering problems. Utilizing the project based learning pedagogy, students will progress from completing structured activities to solving open-ended projects and problems that require them to develop planning, documentation, communication, and other professional skills. Through both individual and collaborative team activities, projects, and problems, students will solve problems using the engineering design process. They will use current 3D design and modeling software to represent and communicate solutions. In addition, the development of computational methods that are commonly used in engineering problem solving, including statistical analysis and mathematical modeling, are emphasized.",
        "equivalent": 10650,
        "full_name": "Engineering Design",
        "id": 10650,
        "lexographic": 1,
        "num": "9828J1",
        "online": false,
        "online_only": false,
        "prereq_string": "Design and Tech",
        "prereqs": [
            [
                "10441"
            ]
        ],
        "semester": true,
        "short_name": "Engineering Des",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10652": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "Ancient Civilizations will be an inquiry-based, in-depth course that will offer students an opportunity to investigate the history of the ancient world's major cultures from their beginning to their decline in the post-classical era from an interdisciplinary perspective. Offered as an elective option aimed at 9th and 10th graders to complete their 4th social studies credit, the course will serve as a foundational course that purports to introduce students to research and analytical skills needed in the upper level courses. In terms of content, the course will explore the increasingly interconnected history of major civilizations and other forms of complex societies that arose in pre-classical through post-classical era Afro-Eurasia, focusing on comparative analysis of the sociopolitical, economic, religious, and cultural traditions and innovations that developed in these ancient societies as well as the webs of communication and exchange that connected these societies spatially and temporally. Investigations of cultural traditions will emphasize the development of scientific and technological breakthroughs and innovations, trace the means and routes by which they spread beyond the society in which they emerged, and the regional and cross-regional impact they wielded on the increasingly interconnected pre-modern world. In specific terms, the civilizations studied in the course will range from Mesopotamia and Egypt in the ancient world, to Greece, Rome, Persia, China, and India in the classical world, to the fall of Rome and the rise of the Islamic world in the early-post-classical world. As a foundational course focusing on inquiry learning and the development of higher order thinking, reading, and writing skills, a heavy emphasis will be based on analyzing and evaluating various types of primary and secondary sources. The course will culminate with a final research project that will integrate these skills and focus on the larger themes of the course.",
        "equivalent": 10652,
        "full_name": "Ancient & Clas Civ",
        "id": 10652,
        "lexographic": 0,
        "num": "2219T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Ancient & Clas Civ",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10678": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "This course is designed to provide students with an understanding of the economic principles which apply to an economic system as a whole. This course is designed to provide students with an understanding of the principles of economics which apply to the functions of decision-makers, both consumers and producers, within economic systems. Topics include, national economics, international economics, the nature and functions of product markets, the study of factor markets, and the role of government in promoting greater efficiency and equity in the economy.. This course fulfills the Economic and Personal Finance and virtual graduation requirements. Students who complete this course are encouraged to take the associated Advanced Placement examinations and may earn college credit if a qualifying score is achieved.",
        "equivalent": 10678,
        "full_name": "AP Macro and Microeconomics",
        "id": 10678,
        "lexographic": 0,
        "num": 280404,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "AP Mac/mic Econ",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "10721": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            false
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "Semester introduction to calculus providing an overview of limits, derivatives, and applications related to those topics.",
        "equivalent": 10721,
        "full_name": "TJ Math 6",
        "id": 10721,
        "lexographic": 5,
        "num": 316056,
        "online": false,
        "online_only": false,
        "prereq_string": "TJ Math 5",
        "prereqs": [
            [
                "10600"
            ]
        ],
        "semester": true,
        "short_name": "TJ Math 6",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10902": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            false,
            false
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "This course is designed to strengthen problem solving skills using algebraic and geometric concepts previously encountered by students. An emphasis on depth, rigor, context, and metacognition will be the highest priority in the class. The goal is to have all students be able to think abstractly, integrate multiple concepts into a single problem, and consider the reasonableness of their solutions. Students will encounter familiar content in unfamiliar circumstances, and will present their results in a written and oral format. The pragmatic usage of technology is integrated throughout the course.",
        "equivalent": 10902,
        "full_name": "TJ Math 2.5",
        "id": 10902,
        "lexographic": 2,
        "num": "0110T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [
            [
                "10598"
            ]
        ],
        "semester": true,
        "short_name": "TJ Math 2.5",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "10908": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students study selected upper level POS themes and topics using more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  They participate in in-depth studies of major literary works and historical events and learn to recognize the various themes and conflicts involved.  Students express abstract ideas while discussing literature, history, and current events.",
        "equivalent": 10908,
        "full_name": "Spanish 5",
        "id": 10908,
        "lexographic": 5,
        "num": 555000,
        "online": false,
        "online_only": false,
        "prereq_string": "Spanish 4, or Advanced Placement Language and Culture, or equivalency test",
        "prereqs": [
            [
                "1477"
            ],
            [
                "1481"
            ]
        ],
        "semester": false,
        "short_name": "Spanish 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10909": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students study selected upper level POS themes and topics using more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  They participate in in-depth studies of major literary works and historical events and learn to recognize the various themes and conflicts involved.  Students express abstract ideas while discussing literature, history, and current events.",
        "equivalent": 10909,
        "full_name": "French 5",
        "id": 10909,
        "lexographic": 5,
        "num": 515000,
        "online": false,
        "online_only": false,
        "prereq_string": "French 4, or Advanced Placement Language and Culture, or equivalency test",
        "prereqs": [
            [
                "1427"
            ],
            [
                "1431"
            ]
        ],
        "semester": false,
        "short_name": "French 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10910": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue their study of Latin prose and/or poetry, improving their reading proficiency as they deepen their understanding of more complex syntax.  Analysis of the Latin texts as literature is emphasized.  Students also develop a greater appreciation of the social and political context in which the various works were written as well as their influence upon later literature.",
        "equivalent": 10910,
        "full_name": "Latin 5",
        "id": 10910,
        "lexographic": 4,
        "num": 535000,
        "online": false,
        "online_only": false,
        "prereq_string": "Latin 4 or equivalency test",
        "prereqs": [
            [
                "1454"
            ]
        ],
        "semester": false,
        "short_name": "Latin 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10911": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students study selected upper level POS themes and topics using more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  They participate in in-depth studies of major literary works and historical events and learn to recognize the various themes and conflicts involved.  Students express abstract ideas while discussing literature, history, and current events.",
        "equivalent": 10911,
        "full_name": "Russian 5",
        "id": 10911,
        "lexographic": 4,
        "num": 545000,
        "online": false,
        "online_only": false,
        "prereq_string": "Russian 4 or equivalency test",
        "prereqs": [
            [
                "1464"
            ]
        ],
        "semester": false,
        "short_name": "Russian 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10912": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students study selected upper level POS themes and topics using more sophisticated communication skills in all four areas - listening, speaking, reading, and writing - with emphasis on the ability to interact orally and in writing.  They participate in in-depth studies of major literary works and historical events and learn to recognize the various themes and conflicts involved.  Students express abstract ideas while discussing literature, history, and current events.",
        "equivalent": 10912,
        "full_name": "Japanese 5",
        "id": 10912,
        "lexographic": 4,
        "num": 595000,
        "online": false,
        "online_only": false,
        "prereq_string": "Level 4 or equivalency test",
        "prereqs": [
            [
                "1527"
            ]
        ],
        "semester": false,
        "short_name": "Japanese 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "10914": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students study selected upper level POS themes and topics using more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  They participate in in-depth studies of major literary works and historical events and learn to recognize the various themes and conflicts involved.  Students express abstract ideas while discussing literature, history, and current events.",
        "equivalent": 10914,
        "full_name": "German 5",
        "id": 10914,
        "lexographic": 5,
        "num": 525000,
        "online": false,
        "online_only": false,
        "prereq_string": "German 4, or Advanced Placement Language and Culture, or equivalency test",
        "prereqs": [
            [
                "1443"
            ],
            [
                "1447"
            ]
        ],
        "semester": false,
        "short_name": "German 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "11011": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Computer Science",
        "coreq_string": "",
        "description": "Students study the foundations of Computer Vision as well as open problems in the field. Topics include image filtering; boundary detection and object segmentation, recognition and detection; motion estimation and structure from motion. Students use Matlab, Open CV and Point Cloud Libraries, and will have the opportunity to explore implementation of the algorithms on parallel architecture.",
        "equivalent": 11011,
        "full_name": "Computer Vision",
        "id": 11011,
        "lexographic": 2,
        "num": 319916,
        "online": false,
        "online_only": false,
        "prereq_string": "AP Computer Science A+ (Data Structures including APCS-A)",
        "prereqs": [
            [
                "6563"
            ]
        ],
        "semester": true,
        "short_name": "Computer Vision",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "11038": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students study selected upper level POS themes and topics using more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  They participate in in-depth studies of major literary works and historical events and learn to recognize the various themes and conflicts involved.  Students express abstract ideas while discussing literature, history, and current events.",
        "equivalent": 11038,
        "full_name": "Chinese 5",
        "id": 11038,
        "lexographic": 5,
        "num": 585000,
        "online": false,
        "online_only": false,
        "prereq_string": "Chinese 4, or Advanced Placement Language and Culture, or equivalency test",
        "prereqs": [
            [
                "5149"
            ],
            [
                "2221"
            ]
        ],
        "semester": false,
        "short_name": "Chinese 5",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "11200": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Computer Science",
        "coreq_string": "",
        "description": "This course is a continuation of Computer Vision 1. Computer Vision algorithms are at the heart of self-driving cars, modern medical imaging devices for diagnosis of disease, asteroid detection mechanisms, robotics and myriad other applications. This course will introduce students to modern approaches based on Deep Learning Models and to open problems in the field and build on their knowledge from earlier computer science and mathematics coursework. Topics covered in the course include large neural networks trained with back propogation and their application to Computer Vision, as well as other advanced techniques.",
        "equivalent": 11200,
        "full_name": "Computer Vision 2",
        "id": 11200,
        "lexographic": 3,
        "num": 319917,
        "online": false,
        "online_only": false,
        "prereq_string": "Computer Vision 1",
        "prereqs": [
            [
                "11011"
            ]
        ],
        "semester": true,
        "short_name": "Computer Vision 2",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "11248": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "General",
        "coreq_string": "",
        "description": "Instruction in economics and personal finance prepares students to function effectively as consumers, savers, investors, entrepreneurs, and active citizens. Students learn how economies and markets operate and how the United States' economy is interconnected with the global economy. On a personal level, students learn that their own human capital (knowledge and skills) is their most valuable resource. Beginning with students entering ninth grade in fall 2011, one standard unit of credit in Economics and Personal Finance is required for graduation. Students who choose an EPF option that requires payment, will not be reimbursed should additional options become available. Industry certification may be available as part of this course.",
        "equivalent": 11248,
        "full_name": "Self-directed Online Economics and Personal Finance--8th Period",
        "id": 11248,
        "lexographic": 0,
        "num": "6120SD",
        "online": true,
        "online_only": true,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Econ & Pers Fin",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "11319": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Health & Physical Education",
        "coreq_string": "",
        "description": "Yoga is an elective physical education course.  Students will learn the physical postures and exercises of yoga that develop strength, flexibility, coordination, and balance.  Relaxation techniques, breathing practices, and mindfulness practices that support fitness and well-being will be incorporated.  Students will apply concepts of basic anatomy and physiology to understand alignment, benefits, and contraindications of yoga poses and exercises.  Students will develop independent, personal yoga practices that can be adapted and modified to their individual needs.  Students will explore nutritional requirements needed for lifelong health and well-being.  Students may not take this course in lieu of the grade 9 or grade 10 health and physical education requirements.",
        "equivalent": 11319,
        "full_name": "Yoga for Wellness",
        "id": 11319,
        "lexographic": 2,
        "num": 751050,
        "online": false,
        "online_only": false,
        "prereq_string": "Successful completion of grade 9 and grade 10 health and physical education.",
        "prereqs": [
            [
                "1569",
                "1570"
            ]
        ],
        "semester": false,
        "short_name": "Yoga",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "11338": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            false
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "This is the first of a two-year, chronologically and thematically organized study of world history and geography.  In this first year, students study the world from ancient times to 1500 CE.  The course highlights the relationship between the geography and history of Europe, Africa, Asia, and Latin America.  Students examine the relationship among social, economic and geopolitical developments across time and place.  They use the processes of conceptual and critical thinking to analyze historical and contemporary issues.  Students are encouraged to think independently while developing group process skills. Additionally, students will apply social science skills -historical thinking, geographic analysis, economic decision making, and responsible citizenship - to course content. World History and Geography 1 at TJHSST satisfies the World History and Geography 1 graduation requirement.",
        "equivalent": 11338,
        "full_name": "World Hist/geog 1",
        "id": 11338,
        "lexographic": 0,
        "num": "2219T2",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "World Hist/geog 1",
        "skiptest": false,
        "summer": true,
        "weight": 0.5
    },
    "11344": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            false
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "Students study right triangle relationships, identities and equations, the unit circle and graphing. Class includes modeling and application problems. Topics include finding values of trigonometric functions, finding exact trigonometric values of special angles in degrees and radians, finding exact angles of inverse trigonometric functions, trigonometric identities, transformations and finding domain, range, amplitude, period, and shifts, graphing inverse trigonometric functions, solving trigonometric equations and inequalities, solving practical problems using the law of sines and cosines, vectors applications, polar coordinate system, using De Moivre's theorem with complex numbers, and three-dimensional modeling and applications. The process standard focus will be Connections.",
        "equivalent": 11344,
        "full_name": "TJ Math 4",
        "id": 11344,
        "lexographic": 3,
        "num": 316154,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [
            [
                "10595"
            ]
        ],
        "semester": true,
        "short_name": "TJ Math 4",
        "skiptest": false,
        "summer": true,
        "weight": 0.5
    },
    "11431": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "General",
        "coreq_string": "",
        "description": "The Honors EPF course expands and enriches the standard Economics and Personal Finance curriculum by incorporating project based learning and curriculum extensions that will require students to analyze the costs and benefits of economic policies to society and to themselves. In addition to being able to define, identify, and understand financial and economic systems, students in the honors course will analyze the differences between domestic and global policies and the evolution, and oftentimes unintended consequences, of those policies.  Students will be able to explain the operation of current financial and economic systems, anticipate advantages and disadvantages of evolving systems, and consider how they can best take advantage of these changes to ensure economic security for our nation and for themselves.",
        "equivalent": 11431,
        "full_name": "Economics and Personal Finance Honors",
        "id": 11431,
        "lexographic": 0,
        "num": 612036,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Econ & Pers Fin Hn",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "11450": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "Microbial Genomics & Bioinformatics will provide a practical introduction to microbial genomics and bioinformatics. Topics include next-generation sequencing, biological databases, sequence alignment, similarity searches, genome browsers, molecular evolution, disease genetics and proteomics. No previous computing experience is required, but would be helpful. Students will utilize computer-based practical modules and tutorials throughout the course that provide hands-on experience with established bioinformatics tools and approaches. Students will come away with the key concepts that underpin microbial bioinformatics and genomics approaches.",
        "equivalent": 11450,
        "full_name": "Microbial Genomics and Bioinformatics",
        "id": 11450,
        "lexographic": 3,
        "num": "4621T1",
        "online": false,
        "online_only": false,
        "prereq_string": "IBET Biology, DNA Science, or AP Biology",
        "prereqs": [
            [
                "6895"
            ],
            [
                "6952"
            ],
            [
                "1382"
            ]
        ],
        "semester": false,
        "short_name": "Microbial Gen&bio",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "11502": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Trade & Industrial",
        "coreq_string": "",
        "description": "Students will study and define the eight major systems of the automobile, related tools and equipment, and the automotive industry. An emphasis will be placed on diagnosing systems, developing troubleshooting skills, and the safe use of laboratory equipment. Curriculum is developed from the National Automotive Technicians Education Foundation (NATEF) task lists. Major topics include engine performance, brakes, electrical and electronic systems, and suspension and steering systems. In addition, students will be tested on NATEF criteria.",
        "equivalent": 11502,
        "full_name": "Automotive Technology 1",
        "id": 11502,
        "lexographic": 0,
        "num": 850600,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Auto Tech 1(base)",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1238": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            false,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "Students study composition and literary analysis at a level equivalent to that of a full-year introductory college course.  Through in-depth study of literary works, students sharpen their awareness of language and their understanding of the writer's craft.  They establish critical standards for analyzing and evaluating literature. Students work to master college-level literary analysis writing, as well as to hone their narrative, persuasive, and research writing skills.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.  Completion of this course fulfills the English 12 course requirement.",
        "equivalent": 1238,
        "full_name": "AP English Literature and Composition",
        "id": 1238,
        "lexographic": 1,
        "num": 119504,
        "online": false,
        "online_only": false,
        "prereq_string": "English 11",
        "prereqs": [
            [
                "6903"
            ]
        ],
        "semester": false,
        "short_name": "AP English Lit/com",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1241": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            false,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "AP English Language and Composition is a college level course designed to improve writing and thinking skills by drawing attention to rhetorical styles and persuasive techniques. Although the AP curriculum stresses nonfiction prose in general and essays in particular, the student writing assignments involve creative work as well as analytical and research writing. Vernacular models of composition including journalistic modes and models that incorporate visual images play a significant role in the AP definition of the course and hence also in the classroom. Students can expect to prepare for the AP Language and Composition exam as well as hone writing skills that they will use in college and future careers.",
        "equivalent": 1241,
        "full_name": "AP English Language and Composition",
        "id": 1241,
        "lexographic": 1,
        "num": 119604,
        "online": false,
        "online_only": false,
        "prereq_string": "English 11",
        "prereqs": [
            [
                "6903"
            ]
        ],
        "semester": false,
        "short_name": "AP English Lan/com",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1246": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In Journalism 1, students learn the history and language of journalism; develop communication skills in writing, designing and editing for a variety of media; understand news and the process of publication; and become more critical readers and consumers of mass media. This course prepares students for continued study in journalism, photojournalism, and broadcast journalism.",
        "equivalent": 1246,
        "full_name": "Journalism 1",
        "id": 1246,
        "lexographic": 0,
        "num": 120000,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Journalism 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1247": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In Journalism 2, students learn and apply techniques of layout, design, and desktop publishing.  Students develop a more sophisticated level of journalistic writing and participate in the operation and production of the high school newspaper and/or student-produced website.  Students also learn skills in business and circulation management.",
        "equivalent": 1247,
        "full_name": "Journalism 2",
        "id": 1247,
        "lexographic": 1,
        "num": 121000,
        "online": false,
        "online_only": false,
        "prereq_string": "Journalism 1",
        "prereqs": [
            [
                "1246"
            ]
        ],
        "semester": false,
        "short_name": "Journalism 2",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1248": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In addition to enhancing their skills as reporters, students in Journalism 3 learn the role of editorial leadership, develop a personal sense of professionalism, understand the role of the newspaper in society, and become productive members of the newspaper and/or student-produced website staff.  Students also learn skills in business and circulation management.",
        "equivalent": 1248,
        "full_name": "Journalism 3",
        "id": 1248,
        "lexographic": 2,
        "num": 121100,
        "online": false,
        "online_only": false,
        "prereq_string": "Journalism 2",
        "prereqs": [
            [
                "1247"
            ]
        ],
        "semester": false,
        "short_name": "Journalism 3",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1249": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            false,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In Journalism 4, students learn marketable publications skills; develop individual writing, layout, and design styles; and may assume editorial leadership and responsibility for producing a high school newspaper and/or student-produced website.  Students also take responsibility for business and circulation management.",
        "equivalent": 1249,
        "full_name": "Journalism 4",
        "id": 1249,
        "lexographic": 3,
        "num": 121200,
        "online": false,
        "online_only": false,
        "prereq_string": "Journalism 3",
        "prereqs": [
            [
                "1248"
            ]
        ],
        "semester": false,
        "short_name": "Journalism 4",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1251": {
        "ap": "pre",
        "approval": true,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In Photojournalism 1, students learn the principles of interviewing, copywriting, photography, layout, and design. Students use publishing software to create pages for the school's yearbook.",
        "equivalent": 1251,
        "full_name": "Photojournalism 1",
        "id": 1251,
        "lexographic": 1,
        "num": 121500,
        "online": false,
        "online_only": false,
        "prereq_string": "Journalism 1 or instructor permission",
        "prereqs": [
            [
                "1246"
            ]
        ],
        "semester": false,
        "short_name": "Photo Journalism 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1252": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In Photojournalism 2, students develop their copywriting skills and advance their photography and design skills as they create pages for the school's yearbook.  They may also become section editors.",
        "equivalent": 1252,
        "full_name": "Photojournalism 2",
        "id": 1252,
        "lexographic": 2,
        "num": 121600,
        "online": false,
        "online_only": false,
        "prereq_string": "Photojournalism 1",
        "prereqs": [
            [
                "1251"
            ]
        ],
        "semester": false,
        "short_name": "Photo Journalism 2",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1253": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In Photojournalism 3, students refine their copywriting skills and advance their computer and photography skills, develop individual style, and may assume leadership roles as members of the yearbook staff's editorial board.",
        "equivalent": 1253,
        "full_name": "Photojournalism 3",
        "id": 1253,
        "lexographic": 3,
        "num": 121700,
        "online": false,
        "online_only": false,
        "prereq_string": "Photojournalism 2",
        "prereqs": [
            [
                "1252"
            ]
        ],
        "semester": false,
        "short_name": "Photo Journalism 3",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1286": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "Throughout the course, students analyze the techniques filmmakers use to create visual stories in a variety of films from different time periods, genres, and cultures. In addition, students apply their film analysis skills to produce original works.",
        "equivalent": 1286,
        "full_name": "Film Study (semester)",
        "id": 1286,
        "lexographic": 0,
        "num": 144632,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Film Study",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1309": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "The Advanced Placement European History covers the basic chronology of events from 1450 (the High Renaissance) to the present.  Students are expected to demonstrate a knowledge of this basic chronology and of major events and trends in the intellectual cultural, political-diplomatic, and social-economic history of modern Europe.  In addition, students are expected to demonstrate an ability to analyze historical evidence and to express that understanding and analysis in writing.   Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1309,
        "full_name": "AP European History",
        "id": 1309,
        "lexographic": 0,
        "num": 239904,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "AP European Hist",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1313": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            false,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "This study of American government is an introduction to the discipline of political science. Students study required US foundational documents and Supreme Court decisions to gain an understanding of the relationships and interactions among political institutions, processes and behaviors. Students learn and apply  the skills of data interpretation, comparison, application and development of an argument. In addition, students will complete a political science research or applied civics project. This course prepares students to take the Advanced Placement examination.  Completion of this course fulfills the graduation requirement for one credit in Virginia and United States Government.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1313,
        "full_name": "AP US Government and Politics",
        "id": 1313,
        "lexographic": 0,
        "num": 244504,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "AP Government",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1325": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "The purpose of this course is to introduce students to the systematic and scientific study of the behavior and mental processes of human beings and other animals.  Students are exposed to the psychological facts, principles, and phenomena associated with each of the major subfields within psychology.  They also learn about the methods psychologists use in their science and practice.  The aim of Advanced Placement Psychology is to provide the students with a learning experience equivalent to that obtained in an introductory college psychology course. The rigorous course syllabus and college level texts both suggest that students who enroll should be highly motivated and intellectually curious. Students who complete this course are encouraged to take the associated Advanced Placement examinations and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1325,
        "full_name": "AP Psychology",
        "id": 1325,
        "lexographic": 0,
        "num": 290204,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "AP Psychology",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1350": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "This course emphasizes a multi-representational approach to calculus.  Concepts, results, and problems are expressed graphically, numerically, analytically, and verbally.  Content includes concepts and applications of differential and integral calculus, limits, and elementary differential equations.Graphing utilities and other relevant technology tools will be used when appropriate to support instruction, especially to allow students to explore graphical, numerical, and symbolic relationships.  Content of this college-level course corresponds to the syllabus of the College Board Calculus AB Advanced Placement Program.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1350,
        "full_name": "AP Calculus AB",
        "id": 1350,
        "lexographic": 5,
        "num": 317004,
        "online": false,
        "online_only": false,
        "prereq_string": "Precalculus with Trigonometry or Precalculus with Trigonometry Honors",
        "prereqs": [
            [
                "10600"
            ],
            []
        ],
        "semester": false,
        "short_name": "AP Calculus AB",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1352": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "This course is an extension of Advanced Placement Calculus AB.  This course emphasizes a multi-representational approach to calculus. Concepts, results, and problems are expressed graphically, numerically, analytically, and verbally.  Content includes concepts and applications of differential and integral calculus, sequences and series, and elementary differential equations.  Graphing utilities and other relevant technology tools will be used when appropriate to support instruction, especially to allow students to explore graphical, numerical, and symbolic relationships.  Content of this college-level course corresponds to the syllabus of the College Board Calculus BC Advanced Placement Program.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1352,
        "full_name": "AP Calculus BC",
        "id": 1352,
        "lexographic": 6,
        "num": 317704,
        "online": false,
        "online_only": false,
        "prereq_string": "Precalculus with Trigonometry Honors or AP Calculus AB.",
        "prereqs": [
            [
                "10600"
            ],
            [
                "1350"
            ]
        ],
        "semester": false,
        "short_name": "AP Calculus BC",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1363": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "This college-level course includes the study of systems of linear equations, vector spaces, linear dependence, linear transformations and matrix representation, orthogonal reduction, determinants, eigenvectors and eigenvalues, and a variety of applications.  This course will receive a weighted grade and may be taken for college credit for a fee through a dual-enrollment agreement with George Mason University.",
        "equivalent": 1363,
        "full_name": "Matrix Algebra",
        "id": 1363,
        "lexographic": 7,
        "num": 319800,
        "online": false,
        "online_only": false,
        "prereq_string": "AP Calculus AB or AP Calculus BC or IB Mathematics Analysis and Approaches HL 2 or IB Mathematics Applications and Interpretation HL 2",
        "prereqs": [
            [
                "1350"
            ],
            [
                "1352"
            ],
            [],
            []
        ],
        "semester": true,
        "short_name": "Matrix Algebra",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1382": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "After completing the core science curriculum, students pursue a more advanced and specialized study of biology topics.  Students conduct standard first year college-level laboratory research as well as analyze and interpret biological data.  Students engage in authentic science practices and examine biology content within four big ideas: 1) the process of evolution drives the diversity of life, 2) biological systems utilize energy and molecular building blocks to grow, reproduce and maintain homeostasis, 3) living systems retrieve, transmit, and respond to information essential to life processes, and 4) biological systems interact, and these interactions possess complex properties.  If dissections are part of the laboratory experience, alternatives are available.  Students are encouraged to take the associated Advanced Placement exam and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1382,
        "full_name": "AP Biology",
        "id": 1382,
        "lexographic": 2,
        "num": 437004,
        "online": false,
        "online_only": false,
        "prereq_string": "Biology 1 and Chemistry 1",
        "prereqs": [
            [
                "6895",
                "6897"
            ]
        ],
        "semester": false,
        "short_name": "AP Biology",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1394": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "Advanced Placement Chemistry is a second-level, laboratory-centered course that provides an opportunity for students to undertake a more comprehensive investigation at a level above Chemistry 1.  It is designed for students who have completed a core science curriculum and are now ready to pursue more advanced and specialized studies. Advanced Placement Chemistry represents a full year (two semesters) of college chemistry.   Students are encouraged to take the associated Advanced Placement exam and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1394,
        "full_name": "AP Chemistry",
        "id": 1394,
        "lexographic": 3,
        "num": 447004,
        "online": false,
        "online_only": false,
        "prereq_string": "Chemistry 1 and Algebra 2",
        "prereqs": [
            [
                "6897",
                "10595"
            ]
        ],
        "semester": false,
        "short_name": "AP Chemistry",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1408": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "AP Calculus AB or BC",
        "description": "Advanced Placement Physics is a second-level course which surveys a broad selection of physics topics at a level above Physics 1. It is designed for students who have completed a core science curriculum and are now ready to pursue more advanced and specialized studies in mechanics, electricity, and magnetism. AP Physics C serves as the foundation in physics for students who wish to pursue physical science or engineering degrees. Students are encouraged to take both the Mechanics Advanced Placement exam and the Electricity and Magnetism Advanced Placement exam and may earn college credit if a qualifying score is achieved.",
        "equivalent": 6898,
        "full_name": "AP Physics C - Mechanics and Electricity and Magnetism",
        "id": 1408,
        "lexographic": 3,
        "num": 457004,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "AP Physics C M&EM",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1419": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures.  This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing.  Students begin to explore and study the POS themes of Personal and Family Life, School Life, Social Life, and Community Life.  For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirement of the high school Advanced Studies diploma.  It also counts toward the total number of credits required for graduation.",
        "equivalent": 1419,
        "full_name": "French 1",
        "id": 1419,
        "lexographic": 0,
        "num": 511000,
        "online": false,
        "online_only": false,
        "prereq_string": "none",
        "prereqs": [],
        "semester": false,
        "short_name": "French 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1424": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing.  They learn to function in real-life situations using more complex sentences and language structures.  They read material on familiar topics and produce short writing samples.  Students continue to explore as they study the POS themes of Home Life, Student Life, Leisure Time, and Vacation and Travel.",
        "equivalent": 1424,
        "full_name": "French 2",
        "id": 1424,
        "lexographic": 1,
        "num": 512000,
        "online": false,
        "online_only": false,
        "prereq_string": "French 1 or equivalency test",
        "prereqs": [
            [
                "1419"
            ]
        ],
        "semester": false,
        "short_name": "French 2",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "1426": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts.  At this level, students comprehend the main ideas of the authentic materials that they read and hear and are able to identify significant details when the topics are familiar.  Students gain a deeper understanding of the world around them while studying the POS themes of Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
        "equivalent": 1426,
        "full_name": "French 3",
        "id": 1426,
        "lexographic": 2,
        "num": 513000,
        "online": false,
        "online_only": false,
        "prereq_string": "French 2 or equivalency test",
        "prereqs": [
            [
                "1424"
            ]
        ],
        "semester": false,
        "short_name": "French 3",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "1427": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  The authentic reading selections are emphasized at this level.  Students communicate using more complex language structures and express abstract ideas with reasonable fluency.  Students are able to create and listen with understanding to reports and presentations.  They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
        "equivalent": 1427,
        "full_name": "French 4",
        "id": 1427,
        "lexographic": 3,
        "num": 514000,
        "online": false,
        "online_only": false,
        "prereq_string": "French 3 or equivalency test",
        "prereqs": [
            [
                "1426"
            ]
        ],
        "semester": false,
        "short_name": "French 4",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "1431": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students study three modes of communication (interpersonal, interpretive and presentational) to approach six units of study, taking a holistic approach.   Students use language structures in context and use them to convey meaning. The course promotes fluency and accuracy to facilitate the study of language and culture.   Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1431,
        "full_name": "AP French Language and Culture",
        "id": 1431,
        "lexographic": 4,
        "num": 517004,
        "online": false,
        "online_only": false,
        "prereq_string": "French 4 or equivalency test",
        "prereqs": [
            [
                "1427"
            ]
        ],
        "semester": false,
        "short_name": "AP French Lang",
        "skiptest": true,
        "summer": false,
        "weight": 1.0
    },
    "1435": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures.  This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing.  Students begin to explore and study the POS themes of Personal and Family Life, School Life, Social Life, and Community Life.  For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirement of the high school Advanced Studies diploma.  It also counts toward the total number of credits required for graduation.",
        "equivalent": 1435,
        "full_name": "German 1",
        "id": 1435,
        "lexographic": 0,
        "num": 521000,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "German 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1440": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing.  They learn to function in real-life situations using more complex sentences and language structures.  They read material on familiar topics and produce short writing samples.  Students continue to explore as they study the POS themes of Home Life, Student Life, Leisure Time, and Vacation and Travel.",
        "equivalent": 1440,
        "full_name": "German 2",
        "id": 1440,
        "lexographic": 1,
        "num": 522000,
        "online": false,
        "online_only": false,
        "prereq_string": "German 1 or equivalency test",
        "prereqs": [
            [
                "1435"
            ]
        ],
        "semester": false,
        "short_name": "German 2",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "1442": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts.  At this level, students comprehend the main ideas of the authentic materials that they read and hear and are able to identify significant details when the topics are familiar.  Students gain a deeper understanding of the world around them while studying the POS themes of Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
        "equivalent": 1442,
        "full_name": "German 3",
        "id": 1442,
        "lexographic": 2,
        "num": 523000,
        "online": false,
        "online_only": false,
        "prereq_string": "German 2 or equivalency test",
        "prereqs": [
            [
                "1440"
            ]
        ],
        "semester": false,
        "short_name": "German 3",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "1443": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  The authentic reading selections are emphasized at this level.  Students communicate using more complex language structures and express abstract ideas with reasonable fluency.  Students are able to create and listen with understanding to reports and presentations.  They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
        "equivalent": 1443,
        "full_name": "German 4",
        "id": 1443,
        "lexographic": 3,
        "num": 524000,
        "online": false,
        "online_only": false,
        "prereq_string": "German 3 or equivalency test",
        "prereqs": [
            [
                "1442"
            ]
        ],
        "semester": false,
        "short_name": "German 4",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "1447": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The AP German Language and Culture course emphasizes communication (understanding and being understood by others) by applying interpersonal, interpretive and presentational skills in real life situations as applied to six themes. This includes vocabulary usage, language control, communication strategies and cultural awareness. The course engages students in an exploration of culture in both contemporary and historical contexts.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1447,
        "full_name": "AP German Language and Culture",
        "id": 1447,
        "lexographic": 4,
        "num": 527004,
        "online": false,
        "online_only": false,
        "prereq_string": "German 4 or equivalency test",
        "prereqs": [
            [
                "1443"
            ]
        ],
        "semester": false,
        "short_name": "AP German Lang",
        "skiptest": true,
        "summer": false,
        "weight": 1.0
    },
    "1448": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students learn basic language structures and essential elements of Latin pronunciation in order to be able to read simple passages in Latin.  The relationship of English to Latin is emphasized in vocabulary building, word derivation, and meanings of prefixes and suffixes.  Language structures and syntax are developed through the study of literary passages.  The geography, history, government and the culture of the Roman Empire are studied.  For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirements of the high school Advanced Studies diploma.  It also counts toward the total number of credits required for graduation.",
        "equivalent": 1448,
        "full_name": "Latin 1",
        "id": 1448,
        "lexographic": 0,
        "num": 531000,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Latin 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1452": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students learn additional vocabulary, more complex language structures and syntax in order to be able to read more challenging passages in Latin.  Language structures and syntax are developed through the study of literary passages.  Students continue to explore as they study Roman life and Rome's contribution to our civilization.",
        "equivalent": 1452,
        "full_name": "Latin 2",
        "id": 1452,
        "lexographic": 1,
        "num": 532000,
        "online": false,
        "online_only": false,
        "prereq_string": "Level 1 or equivalency test",
        "prereqs": [
            [
                "1448"
            ]
        ],
        "semester": false,
        "short_name": "Latin 2",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "1453": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop and refine their reading skills through the study of Latin literature.  Additional vocabulary, more complex language structures and syntax are emphasized in order to be able to read the writings of prose authors.  Through translation and interpretation, students gain a greater understanding of the foundation of Western government and civilization.",
        "equivalent": 1453,
        "full_name": "Latin 3",
        "id": 1453,
        "lexographic": 2,
        "num": 533000,
        "online": false,
        "online_only": false,
        "prereq_string": "Latin 2 or equivalency test",
        "prereqs": [
            [
                "1452"
            ]
        ],
        "semester": false,
        "short_name": "Latin 3",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "1454": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop and refine their reading skills through the study of Latin literature.  Students read Vergil's Aeneid silently for comprehension and orally for poetic meter and analyze the various passages for content, connotation of words and author's style.  Students study the life and times of Vergil, his influence on later writers, his poetic devices, and his Aeneid as a literary work.",
        "equivalent": 1454,
        "full_name": "Latin 4",
        "id": 1454,
        "lexographic": 3,
        "num": 534000,
        "online": false,
        "online_only": false,
        "prereq_string": "Latin 3 or equivalency test",
        "prereqs": [
            [
                "1453"
            ]
        ],
        "semester": false,
        "short_name": "Latin 4",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "1456": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The AP Latin course focuses on the in-depth study of selections from two of the greatest works in Latin literature: Vergil’s Aeneid and Caesar’s Gallic War. Students study the literary techniques used by Roman authors by reading Latin poetry and prose with historical and literary sensitivity. Students are encouraged to develop linguistic skills by engaging in multiple activities, including translating poetry and prose from the required-reading list, precisely and literally; reading passages of poetry and prose with comprehension; and analyzing literary texts in clear, coherent written arguments, supported by textual examples. Students who complete this course are encouraged to take the associated Advanced Placement  examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1456,
        "full_name": "AP Latin",
        "id": 1456,
        "lexographic": 4,
        "num": 537004,
        "online": false,
        "online_only": false,
        "prereq_string": "Latin 3, Latin 4, or equivalency test",
        "prereqs": [
            [
                "1453"
            ],
            [
                "1454"
            ]
        ],
        "semester": false,
        "short_name": "AP Latin-vergil",
        "skiptest": true,
        "summer": false,
        "weight": 1.0
    },
    "1461": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures.  This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing.  Students begin to explore and study the themes of Personal and Family Life, School Life, Social Life, and Community Life.",
        "equivalent": 1461,
        "full_name": "Russian 1",
        "id": 1461,
        "lexographic": 0,
        "num": 541000,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Russian 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1462": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing.  They learn to function in real-life situations using more complex sentences and language structures.  They read material on familiar topics and produce short writing samples.  Students continue to explore as they study the themes of Home Life, Student Life, Leisure Time, and Vacation and Travel.",
        "equivalent": 1462,
        "full_name": "Russian 2",
        "id": 1462,
        "lexographic": 1,
        "num": 542000,
        "online": false,
        "online_only": false,
        "prereq_string": "Russian 1 or equivalency test",
        "prereqs": [
            [
                "1461"
            ]
        ],
        "semester": false,
        "short_name": "Russian 2",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "1463": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to interact orally and in writing.  They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts.  At this level, students comprehend the main ideas of the authentic materials that they read and hear, and they are able to identify significant details when the topics are familiar.  Students gain a deeper understanding of the world around them while studying Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
        "equivalent": 1463,
        "full_name": "Russian 3",
        "id": 1463,
        "lexographic": 2,
        "num": 543000,
        "online": false,
        "online_only": false,
        "prereq_string": "Russian 2 or equivalency test",
        "prereqs": [
            [
                "1462"
            ]
        ],
        "semester": false,
        "short_name": "Russian 3",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "1464": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  The authentic reading selections are emphasized at this level.  Students communicate using more complex language structures and express abstract ideas with reasonable fluency.  Students are able to create and listen with understanding to reports and presentations.  They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
        "equivalent": 1464,
        "full_name": "Russian 4",
        "id": 1464,
        "lexographic": 3,
        "num": 544000,
        "online": false,
        "online_only": false,
        "prereq_string": "Russian 3 or equivalency test",
        "prereqs": [
            [
                "1463"
            ]
        ],
        "semester": false,
        "short_name": "Russian 4",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "1465": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures.  This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing.  Students begin to explore and study the POS themes of Personal and Family Life, School Life, Social Life, and Community Life.  For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirements of the high school Advanced Studies diploma.  It also counts toward the total number of credits required for graduation.",
        "equivalent": 1465,
        "full_name": "Spanish 1",
        "id": 1465,
        "lexographic": 0,
        "num": 551000,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Spanish 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1472": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing.  They learn to function in real-life situations using more complex sentences and language structures.  They read material on familiar topics and produce short writing samples.  Students continue to explore as they study the POS themes of Home Life, Student Life, Leisure Time, and Vacation and Travel.",
        "equivalent": 1472,
        "full_name": "Spanish 2",
        "id": 1472,
        "lexographic": 1,
        "num": 552000,
        "online": false,
        "online_only": false,
        "prereq_string": "Spanish 1 or equivalency test",
        "prereqs": [
            [
                "1465"
            ]
        ],
        "semester": false,
        "short_name": "Spanish 2",
        "skiptest": true,
        "summer": true,
        "weight": 0
    },
    "1475": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts.  At this level, students comprehend the main ideas of the authentic materials that they read and hear and are able to identify significant details when the topics are familiar.  Students gain a deeper understanding of the world around them while studying the POS themes of Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
        "equivalent": 1475,
        "full_name": "Spanish 3",
        "id": 1475,
        "lexographic": 2,
        "num": 553000,
        "online": false,
        "online_only": false,
        "prereq_string": "Spanish 2 or equivalency test",
        "prereqs": [
            [
                "1472"
            ]
        ],
        "semester": false,
        "short_name": "Spanish 3",
        "skiptest": true,
        "summer": true,
        "weight": 0
    },
    "1477": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  The authentic reading selections are emphasized at this level.  Students communicate using more complex language structures and express abstract ideas with reasonable fluency.  Students are able to create and listen with understanding to reports and presentations.  They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
        "equivalent": 1477,
        "full_name": "Spanish 4",
        "id": 1477,
        "lexographic": 3,
        "num": 554000,
        "online": false,
        "online_only": false,
        "prereq_string": "Spanish 3 or equivalency test",
        "prereqs": [
            [
                "1475"
            ]
        ],
        "semester": false,
        "short_name": "Spanish 4",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "1481": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students study the use of language for active communication.  Specifically, they understand the spoken target language in both formal and conversational situations.  They express ideas accurately and resourcefully, both orally and in writing, with reasonable fluency, and they develop a vocabulary sufficiently ample for reading newspaper and magazine articles, contemporary literature, and other non technical writings.  They receive extensive training in the organization and writing of compositions, review syntax, and study selected works by contemporary authors.  Materials will include recordings, films, newspapers, and magazines. Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1481,
        "full_name": "AP Spanish Language and Culture",
        "id": 1481,
        "lexographic": 4,
        "num": 557004,
        "online": false,
        "online_only": false,
        "prereq_string": "Spanish 4 or equivalency test",
        "prereqs": [
            [
                "1477"
            ]
        ],
        "semester": false,
        "short_name": "AP Spanish Lang",
        "skiptest": true,
        "summer": false,
        "weight": 1.0
    },
    "1483": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "The AP Spanish Literature and Culture course uses a thematic approach to introduce students to representative texts (short stories, novels, poetry, and essays) from Peninsular Spanish, Latin American, and United States Hispanic literature. Students develop proficiencies across the full range of communication modes (interpersonal, presentational, and interpretive).The course includes a strong focus on cultural connections and comparisons.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1483,
        "full_name": "AP Spanish Literature and Culture",
        "id": 1483,
        "lexographic": 5,
        "num": 558004,
        "online": false,
        "online_only": false,
        "prereq_string": "Level 4, or Advanced Placement Language and Culture, or equivalency test",
        "prereqs": [
            [
                "1477"
            ],
            [
                "1481"
            ]
        ],
        "semester": false,
        "short_name": "AP Spanish Lit",
        "skiptest": true,
        "summer": false,
        "weight": 1.0
    },
    "1522": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures.  This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing.  The Kana system of writing, along with some basic characters, is taught in this course.  Students begin to explore and study the themes of Personal and Family Life, School Life, Social Life, and Community Life.  For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirements of the high school Advanced Studies diploma.  It also counts toward the total number of credits required for graduation.",
        "equivalent": 1522,
        "full_name": "Japanese 1",
        "id": 1522,
        "lexographic": 0,
        "num": 591000,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Japanese 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1524": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing.  They learn to function in real-life situations using more complex sentences and language structures.  They read material on familiar topics and produce short writing samples.  Students continue to explore as they study the themes of Home Life, Student Life, Leisure Time, and Vacation and Travel.",
        "equivalent": 1524,
        "full_name": "Japanese 2",
        "id": 1524,
        "lexographic": 1,
        "num": 592000,
        "online": false,
        "online_only": false,
        "prereq_string": "Japanese 1 or equivalency test",
        "prereqs": [
            [
                "1522"
            ]
        ],
        "semester": false,
        "short_name": "Japanese 2",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "1526": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to interact orally and in writing.  They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts.  At this level, students comprehend the main ideas of the authentic materials that they read and hear, and they are able to identify significant details when the topics are familiar.  Students gain a deeper understanding of the world around them while studying Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
        "equivalent": 1526,
        "full_name": "Japanese 3",
        "id": 1526,
        "lexographic": 2,
        "num": 593000,
        "online": false,
        "online_only": false,
        "prereq_string": "Japanese 2 or equivalency test",
        "prereqs": [
            [
                "1524"
            ]
        ],
        "semester": false,
        "short_name": "Japanese 3",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "1527": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  The authentic reading selections are emphasized at this level.  Students communicate using more complex language structures and express abstract ideas with reasonable fluency.  Students are able to create and listen with understanding to reports and presentations.  They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
        "equivalent": 1527,
        "full_name": "Japanese 4",
        "id": 1527,
        "lexographic": 3,
        "num": 594000,
        "online": false,
        "online_only": false,
        "prereq_string": "Japanese 3 or equivalency test",
        "prereqs": [
            [
                "1526"
            ]
        ],
        "semester": false,
        "short_name": "Japanese 4",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "1533": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "General",
        "coreq_string": "",
        "description": "Instruction in economics and personal finance prepares students to function effectively as consumers, savers, investors, entrepreneurs, and active citizens. Students learn how economies and markets operate and how the United States' economy is interconnected with the global economy. On a personal level, students learn that their own human capital (knowledge and skills) is their most valuable resource.  Beginning with students entering ninth grade in fall 2011, one standard unit of credit in Economics and Personal Finance is required for graduation. Students who choose an EPF option that requires payment, will not be reimbursed should additional options become available.",
        "equivalent": 1533,
        "full_name": "Economics and Personal Finance",
        "id": 1533,
        "lexographic": 0,
        "num": 612000,
        "online": true,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Econ & Pers Fin",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1569": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            false,
            false,
            false
        ],
        "category": "Health & Physical Education",
        "coreq_string": "",
        "description": "Students demonstrate the ability to use basic skills, strategies, and tactics in a variety of lifetime physical activities. Students will continue to gain and demonstrate more specialized knowledge in identifying and applying key movement concepts and principles.  In health education students integrate a variety of health concepts, skills, and behaviors to develop plans for their lifelong health and fitness goals. These include awareness and consequences of risky behaviors, disease prevention, overall wellness, and identification of community health resources. They see themselves as having an active role in creating a healthy lifestyle for themselves, for their families, and for the community.  Instruction in first aid, cardiopulmonary resuscitation (CPR), and automated external defibrillation (AED) is included.",
        "equivalent": 1569,
        "full_name": "Health and Physical Education 9",
        "id": 1569,
        "lexographic": 0,
        "num": 730000,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Health & Pe 9",
        "skiptest": false,
        "summer": true,
        "weight": 0
    },
    "1570": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            false,
            false
        ],
        "category": "Health & Physical Education",
        "coreq_string": "",
        "description": "Students demonstrate competency in lifelong physical activities and plan, implement, self-assess, and modify a personal fitness plan.  Students develop the ability to understand and anticipate how physical activity interests and abilities change through their lifetime.  Students continue their learning of health education through in-depth exploration of health topics, health-related careers, and will continue to develop personal wellness plans.  The course includes one quarter of instruction in classroom driver education during which students gain knowledge to become proficient users of the highway transportation system.  The 90-minute parent/teen traffic safety presentation (Partner’s for Safe Teen Driving) is offered to fulfill the requirements of juvenile licensing.  Grades from all quarters are averaged to determine the final course grade.",
        "equivalent": 1570,
        "full_name": "Health and Physical Education 10",
        "id": 1570,
        "lexographic": 1,
        "num": 740500,
        "online": false,
        "online_only": false,
        "prereq_string": "Successful completion of Health and Physical Education, grade 9",
        "prereqs": [
            [
                "1569"
            ],
            []
        ],
        "semester": false,
        "short_name": "Health & Pe 10",
        "skiptest": false,
        "summer": true,
        "weight": 0
    },
    "1891": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Explore a variety of exciting opportunities and materials to inform the artmaking process. Learn to think conceptually and realize potential as a creative and critical thinker in order to meet the challenges of 21st century living.  Explore personal interests related to the theme of a sense of place while developing skills in the areas of drawing, painting, printmaking, ceramics, sculpture, and digital media.  Course content includes art production, art appreciation, and studies in visual culture.",
        "equivalent": 1891,
        "full_name": "Studio Art and Design 1",
        "id": 1891,
        "lexographic": 0,
        "num": 912000,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Stud Art & Des 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1892": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Cultivate previously developed artistic knowledge and skills learned in Studio Art and Design 1.  Explore new combinations and possibilities in the use of two-dimensional and three-dimensional media including technological applications.  Investigate contemporary topics, artistic expression, and design related to the theme perceptions of self.  Ask questions, solve problems, create products, and communicate ideas in innovative ways.  Course content includes art production, design thinking, art history, criticism, aesthetics, and studies in visual culture.",
        "equivalent": 1892,
        "full_name": "Studio Art and Design 2",
        "id": 1892,
        "lexographic": 1,
        "num": 913000,
        "online": false,
        "online_only": false,
        "prereq_string": "Studio Art and Design 1",
        "prereqs": [
            [
                "1891"
            ]
        ],
        "semester": false,
        "short_name": "Stud Art & Des 2",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1893": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Expand and improve artistic understandings and skills by using creative processes.  Develop an individual style and voice to communicate ideas.  Articulate responses to social and contemporary issues through the integration of traditional and electronic media.  Present artworks in diverse formats.  Course content includes art production, design application, art history, criticism, aesthetics, and studies in visual culture.",
        "equivalent": 1893,
        "full_name": "Studio Art and Design 3",
        "id": 1893,
        "lexographic": 2,
        "num": 914000,
        "online": false,
        "online_only": false,
        "prereq_string": "Studio Art and Design 2",
        "prereqs": [
            [
                "1892"
            ]
        ],
        "semester": false,
        "short_name": "Stud Art & Des 3",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1894": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            false,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Engage in advanced study of art production, art history, aesthetics, and art criticism while maintaining the attitude and self-discipline of a working artist.  Practice and exhibit technical proficiency and personal style, work in advanced media, and apply professional presentation techniques to develop and prepare artwork for exhibitions and portfolios.  Demonstrate quality, concentration, and breadth of experience in a body of work and select work for personal exhibitions, exit portfolios, and presentation portfolios.",
        "equivalent": 1894,
        "full_name": "Studio Art & Design 4: Portfolio Preparation General",
        "id": 1894,
        "lexographic": 3,
        "num": 914700,
        "online": false,
        "online_only": false,
        "prereq_string": "Studio Art and Design 3",
        "prereqs": [
            [
                "1893"
            ]
        ],
        "semester": false,
        "short_name": "Stud Art/des 4 P/p",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "1900": {
        "ap": "ap",
        "approval": true,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "This course is designed for highly motivated, advanced art students who have demonstrated a serious interest in the study of art.  Ideally suited for students who work well independently, the course will focus on the preparation of a two-dimensional design portfolio of artworks that exhibit quality, concentration in an area of visual interest or problem solving, and breadth of experience in the formal, technical, and expressive means of an artist.  The two-dimensional portfolio may include, but is not limited to, forms of artwork in graphic design, typography, digital imaging, photography, collage, fabric design, weaving, illustration, painting, and printmaking.  Students will submit two-dimensional portfolios based on objectives that reflect the format and requirements established by the College Board for Advanced Placement Studio Art.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1900,
        "full_name": "AP Studio Art: 2-d Design Portfolio",
        "id": 1900,
        "lexographic": 2,
        "num": 914804,
        "online": false,
        "online_only": false,
        "prereq_string": "Studio Art and Design 1 and 2 or permission of the instructor",
        "prereqs": [
            [
                "1891",
                "1892"
            ]
        ],
        "semester": false,
        "short_name": "AP Art 2d Design",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1904": {
        "ap": "ap",
        "approval": true,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "This course is designed for highly motivated, advanced art students who have demonstrated a serious interest in the study of art.  Ideally suited for students who work well independently, the course will focus on the preparation of a drawing portfolio of artworks that exhibit quality, concentration in an area of visual interest or problem solving, and breadth of experience in the formal, technical, and expressive means of an artist.  The drawing portfolio addresses a broad interpretation of drawing issues including painting, printmaking, studies for sculpture, some forms of design, and abstract and observational works.  Students will prepare and submit drawing portfolios based on objectives that reflect the format and requirements established by the College Board for Advanced Placement Studio Art.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1904,
        "full_name": "AP Studio Art: Drawing Portfolio",
        "id": 1904,
        "lexographic": 2,
        "num": 915004,
        "online": false,
        "online_only": false,
        "prereq_string": "Studio Art and Design 1 and 2 or permission of the instructor",
        "prereqs": [
            [
                "1891",
                "1892"
            ]
        ],
        "semester": false,
        "short_name": "AP Studio Art-draw",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1905": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Students develop the ability to critically analyze major forms of artistic expression including architecture, sculpture and other media t within their historical context by examining issues such as politics, religion, patronage, gender, function, and ethnicity. The course also specifies course content and identifies works of art students are required to understand to support their in-depth learning.  . Students should demonstrate a high degree of commitment to academic work and possess academic skills needed to pursue a program designed to meet college standards. The course prepares students for the Advanced Placement Art History examination, for which two semesters of college credit and/or placement may be awarded if a qualifying score is achieved.  Objectives for Advanced Placement courses reflect the format and requirements in the Advanced Placement Course Description for Art published by the College Board. No prior experience in art studio or art history is assumed.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1905,
        "full_name": "AP: Art History",
        "id": 1905,
        "lexographic": 0,
        "num": 915104,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "AP Art History",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "1996": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Music",
        "coreq_string": "",
        "description": "The purpose of this course is to prepare students to take the Advanced Placement Music Theory examination, with college credit and/or placement being awarded if a qualifying score is achieved.  Students are given a solid foundation in intervals, pitch patterns, metric/rhythmic patterns, chords, and the terms that are part of a basic understanding of reading, performing, and listening to music.  Analysis, elementary composition, aural skills, sight-singing, and keyboard harmony will also be studied.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 1996,
        "full_name": "AP Music Theory",
        "id": 1996,
        "lexographic": 0,
        "num": 922604,
        "online": false,
        "online_only": false,
        "prereq_string": "Music Theory or equivalency exam",
        "prereqs": [],
        "semester": false,
        "short_name": "AP Music Theory",
        "skiptest": true,
        "summer": false,
        "weight": 1.0
    },
    "2009": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Music",
        "coreq_string": "",
        "description": "Students continue developing as individual musicians and as members of a musical group.  Emphasis is placed on the development of intermediate level technical and ensemble skills necessary for performance.  Marching band techniques and performances may be included.  Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
        "equivalent": 2009,
        "full_name": "Band",
        "id": 2009,
        "lexographic": 0,
        "num": 923315,
        "online": false,
        "online_only": false,
        "prereq_string": "Beginning Band or successful audition",
        "prereqs": [],
        "semester": false,
        "short_name": "Band",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "2027": {
        "ap": "pre",
        "approval": true,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Music",
        "coreq_string": "",
        "description": "Students continue developing as individual musicians and as members of a musical group.  Emphasis is placed on the development of intermediate level technical and ensemble skills necessary for performance.  Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
        "equivalent": 2027,
        "full_name": "Orchestra",
        "id": 2027,
        "lexographic": 0,
        "num": 923815,
        "online": false,
        "online_only": false,
        "prereq_string": "Attainment of beginning level skills and permission of instructor",
        "prereqs": [],
        "semester": false,
        "short_name": "Orchestra",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "2059": {
        "ap": "pre",
        "approval": true,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Music",
        "coreq_string": "Schools may require membership in band or advanced band class, and may require participation in marching band.",
        "description": "The instrumental jazz ensemble curriculum emphasizes improvisation and styles of the jazz idiom.  Content includes the study of blues scale patterns and harmonic progressions innate in jazz music.  Content also includes the study of the appropriate jazz literature and rehearsal and performance techniques.  Instrumentation of the jazz ensemble is at the discretion of the instructor. Marching band techniques and performances may be included.  Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
        "equivalent": 2059,
        "full_name": "Jazz Ensemble",
        "id": 2059,
        "lexographic": 0,
        "num": 924015,
        "online": false,
        "online_only": false,
        "prereq_string": "Successful audition or permission of the instructor",
        "prereqs": [],
        "semester": false,
        "short_name": "Jazz Ensemble",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "2089": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Music",
        "coreq_string": "Schools may also require membership in band or advanced band, chorus or orchestra class. Participation in marching band may be a required part of this course.",
        "description": "The percussion ensemble class is designed to meet specific needs of percussionists.  Content includes study of the appropriate ensemble literature, and rehearsal and performance techniques from the various areas of musical composition.  Instrumentation of the group is at the discretion of the instructor.  Marching band techniques and performances may be included. Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
        "equivalent": 2089,
        "full_name": "Percussion Ensemble",
        "id": 2089,
        "lexographic": 0,
        "num": 925015,
        "online": false,
        "online_only": false,
        "prereq_string": "Successful audition",
        "prereqs": [],
        "semester": false,
        "short_name": "Percussion Ensemb",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "2111": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Music",
        "coreq_string": "",
        "description": "Students will participate in a chorus of mixed voices.  Emphasis is placed upon correct vocal performance techniques and sight-singing through the study of appropriate choral literature.  Based on successful completion of sequential concepts for each level, students will continue to learn progressive  musical concepts..  Students must meet both the school day and outside of the school day participation requirements to receive credit for the course.",
        "equivalent": 2111,
        "full_name": "Mixed Chorus",
        "id": 2111,
        "lexographic": 0,
        "num": 926015,
        "online": false,
        "online_only": false,
        "prereq_string": "none",
        "prereqs": [],
        "semester": false,
        "short_name": "Mixed Chorus",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "2204": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "A third semester college-level course, Multivariable calculus is the calculus of three dimensions and includes the study of partial differentiation, multiple integrals, and line integrals.  This course will receive a weighted grade and may be taken for college credit for a fee through a dual-enrollment agreement with George Mason University.",
        "equivalent": 2204,
        "full_name": "Multivariable Calculus",
        "id": 2204,
        "lexographic": 7,
        "num": 317860,
        "online": false,
        "online_only": false,
        "prereq_string": "AP Calculus BC or IB Mathematics Analysis and Approaches HL 2",
        "prereqs": [
            [
                "1352"
            ],
            []
        ],
        "semester": true,
        "short_name": "Multivar Calculus",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "2205": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "Students study the methods and solutions of various types of differential equations, including first order, higher order with constant coefficients, systems of linear differential equations, inverse differential operators, the LaPlace transformation, power series solutions, and hypergeometric type equations.  This course will receive a weighted grade and may be taken for college credit for a fee through a dual-enrollment agreement with George Mason University.",
        "equivalent": 2205,
        "full_name": "Elementary Differential Equations",
        "id": 2205,
        "lexographic": 8,
        "num": 317861,
        "online": false,
        "online_only": false,
        "prereq_string": "Multivariable Calculus",
        "prereqs": [
            [
                "2204"
            ]
        ],
        "semester": true,
        "short_name": "El Diff Equations",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "2220": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students study the use of language for active communication.  Specifically, they understand the spoken target language in both formal and conversational situations.  They express ideas accurately and resourcefully, both orally and in writing, with reasonable fluency, and they develop a vocabulary sufficiently ample for reading newspaper and magazine articles, contemporary literature, and other non technical writings.  They receive extensive training in the organization and writing of compositions, review syntax, and study selected works by contemporary authors.  Materials will include recordings, films, newspapers, and magazines.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 2220,
        "full_name": "AP Japanese Language and Culture",
        "id": 2220,
        "lexographic": 4,
        "num": 597004,
        "online": false,
        "online_only": false,
        "prereq_string": "Japanese 4 or equivalency test",
        "prereqs": [
            [
                "1527"
            ]
        ],
        "semester": false,
        "short_name": "AP Japanese",
        "skiptest": true,
        "summer": false,
        "weight": 1.0
    },
    "2221": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "In this course, students study the use of language for active communication. Emphasis is placed on the development of the three modes of communication (interpersonal, interpretive and presentational). The course is structured around six overarching themes: Beauty, and Aesthetics, Contemporary Life, Families and Communities, Global Challenges, Personal and Public Identities,  and Science and Technology.  Students use language structures in context and use them to convey meaning. The course promotes fluency and accuracy to facilitate the study of language and culture.  Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 2221,
        "full_name": "AP Chinese Language and Culture",
        "id": 2221,
        "lexographic": 4,
        "num": 584004,
        "online": false,
        "online_only": false,
        "prereq_string": "Chinese 4 or equivalency",
        "prereqs": [
            [
                "5149"
            ]
        ],
        "semester": false,
        "short_name": "AP Chinese",
        "skiptest": true,
        "summer": false,
        "weight": 1.0
    },
    "2283": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            false
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "In this class blocked with AP English Language and Composition, students consider the ways literature reflects history and the human experience as they refine their awareness of language and the writer's craft.  They make connections between history and literature while examining the American experience.  Students acquire conceptual knowledge and strengthen critical thinking skills by studying the political, economic, social, and cultural growth of the United States.  Students study primary documents and engage in research and writing.  They study traditional and contemporary American beliefs, values and characteristics.  In this course, students receive one credit in Advanced Placement United States History and one credit in AP Language and Composition (119667). Students who complete this course are encouraged to take the associated Advanced Placement examination and may earn college credit if a qualifying score is achieved.",
        "equivalent": 2283,
        "full_name": "AP US History (American Civilization)",
        "id": 2283,
        "lexographic": 0,
        "num": 231905,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "AP US History",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "4423": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            false,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In Photojournalism 4, students continue to refine their copywriting skills and advance their computer and photography skills, develop individual style, and assume leadership roles.",
        "equivalent": 4423,
        "full_name": "Photojournalism 4",
        "id": 4423,
        "lexographic": 4,
        "num": 121714,
        "online": false,
        "online_only": false,
        "prereq_string": "Photojournalism 3",
        "prereqs": [
            [
                "1253"
            ]
        ],
        "semester": false,
        "short_name": "Photo Journalism 4",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "4435": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Theatre Arts",
        "coreq_string": "",
        "description": "Theatre Arts 1 provides students with a survey of the theatre arts, allowing students opportunities to experience and appreciate dramatic literature, and participate in the creative processes of performance and production.  The course emphasizes skill development and provides theatrical opportunities that enable students to determine personal areas of interest.  Participation in co-curricular theatre productions may be arranged.",
        "equivalent": 4435,
        "full_name": "Theatre Arts 1",
        "id": 4435,
        "lexographic": 0,
        "num": 141032,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Theatre Arts 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "4440": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Theatre Arts",
        "coreq_string": "",
        "description": "Theatre Arts 2 integrates and builds upon concepts and skills from Theatre Arts 1.  Through various modes of expression and performance, students investigate dramatic literature, theatrical styles, and historical periods.  Students will study and respond to a variety of theatre experiences that will refine their communicative, collaborative, analytical, interpretive, and problem solving skills. Students will expand their artistic abilities and appreciation of the theatrical arts. Students must meet both the school day and after-school participation requirements to receive credit for the course.",
        "equivalent": 4440,
        "full_name": "Theatre Arts 2",
        "id": 4440,
        "lexographic": 1,
        "num": 142032,
        "online": false,
        "online_only": false,
        "prereq_string": "Theatre Arts 1",
        "prereqs": [
            [
                "4435"
            ]
        ],
        "semester": true,
        "short_name": "Theatre Arts 2",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "4444": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Theatre Arts",
        "coreq_string": "",
        "description": "Students exhibit independence, discipline, and commitment to the theatre process through their work on assigned projects. Advanced work in acting skills and preparation, play analysis, and character interpretation are expected. Collaboration with actors and directors is augmented by special assignments and opportunities.  Students must meet both the school day and after-school participation requirements to receive credit for the course.",
        "equivalent": 4444,
        "full_name": "Theatre Arts 3",
        "id": 4444,
        "lexographic": 2,
        "num": 143032,
        "online": false,
        "online_only": false,
        "prereq_string": "Theatre Arts 2",
        "prereqs": [
            [
                "4440"
            ]
        ],
        "semester": true,
        "short_name": "Theatre Arts 3",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "4449": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Theatre Arts",
        "coreq_string": "",
        "description": "Students explore various areas of technical theatre such as lighting, costumes, sound, scenery, makeup, properties, and theatre management. An analysis of dramatic literature leads students to an understanding of the design and production process.  Participation in co-curricular productions is strongly encouraged.",
        "equivalent": 4449,
        "full_name": "Technical Theatre 1",
        "id": 4449,
        "lexographic": 0,
        "num": 143532,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Tech Theatre 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "4451": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Theatre Arts",
        "coreq_string": "",
        "description": "Students identify areas of special interest in theatre arts, and initiate and complete major research and/or creative projects, such as playwriting, producing, directing, designing and stage-managing. Emphasis is placed on in-depth study and completion of projects, assumption of leadership roles, and expansion of criteria for self-evaluation. Students will analyze and evaluate scripts, concentrate on vocal and physical dramatics, and undertake a special theatre project production.  Students must meet both the school day and after-school participation requirements to receive credit for the course.",
        "equivalent": 4451,
        "full_name": "Theatre Arts 4",
        "id": 4451,
        "lexographic": 3,
        "num": 144032,
        "online": false,
        "online_only": false,
        "prereq_string": "Theatre Arts 3",
        "prereqs": [
            [
                "4444"
            ]
        ],
        "semester": true,
        "short_name": "Theatre Arts 4",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "4539": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "Twentieth-Century World History is a concise, truly global survey of the period from 1885 (Berlin Conference) to the fall of communism in the late 1980s. The course is devoted to crises in Europe from 1914 to 1939; the struggle against colonialism in Africa and Asia; World Wars I and II and the Cold war; the impact of revolution; and the growth of independence in Africa, Asia, and Latin America. Also included in the course of study are two case studies on the impact of technology on history and geography: the Panama Canal and the building of the Aswan Dam.",
        "equivalent": 4539,
        "full_name": "20th Cent Wrld Hist",
        "id": 4539,
        "lexographic": 0,
        "num": "2340T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "20th Cen Wrld Hist",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "4593": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "This course is designed to give students a practical understanding of the law and to provide them with the analytical and problem-solving techniques that are essential to survival in our litigious society. Through mock trials, case studies, law-related research and analysis, moot courts, films, and seminar discussions, students will explore the intricacies of law in the United States and the role it plays in their lives everyday. Major topics of study include: criminal law, civil law, cyber law, law and terrorism, the criminal justice process, and legal history. Throughout the course, students are asked to examine and reflect upon the power, the passion, and the poetry of the law.",
        "equivalent": 4593,
        "full_name": "Law and Society",
        "id": 4593,
        "lexographic": 0,
        "num": "2420T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Law and Society",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "4670": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "All too often, the forgotten part of history instruction is the history of our own lives. Students may be aware of great moments, events and trends from the Roman era, the Renaissance, and the Industrial Revolution but unaware or nominally aware of the end of the Cold War, the rise of the European Union or China as economic powers, or even domestic events such as the Republican Revolution. This course is designed to fill those gaps. While this is in large measure a history course, the curriculum may evolve depending on current events as they reflect trends of the last two decades. Nonetheless, subject areas will include the end of the Cold War and fall of the Soviet Union, the breakup and civil war in Yugoslavia, the rise of the European Union, China and East Asia as global powers, the rise of the left in Latin America, new developments in the Middle East, and politics in America in the 1980s and 1990s. The course will function as a readings seminar. In each unit, students will read, discuss, and present on articles from periodicals such as Current History, Foreign Affairs, Atlantic Monthly, and major newspapers. They will also spend a good deal of time simply becoming familiar with the geography of the areas to be studied, and the names of domestic and foreign leaders and thinkers.",
        "equivalent": 4670,
        "full_name": "Am/wrld Since 1989",
        "id": 4670,
        "lexographic": 0,
        "num": "2996T2",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Am/wrld Since 1989",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "4884": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "Students study properties of complex numbers and elementary functions of complex numbers. Differentiation of elementary functions and the idea of complex limits and analyticity are introduced and explored at a rigorous level. The concept of a rigorous proof is extended in this class, and students learn not only how to do specific problems but also why these techniques work and the logic underlying the techniques. Complex integration is then introduced, and the famous Cauchy Theorem, along with many of its implications, is explored. Topics include series representation of analytic functions, Laurent expansions of meromorphic functions, the calculus of residues, and conformal mappings along with several of their scientific applications especially those involving fluid flow and steady-state temperature distributions. Dual enrollment at GMU is available for this course, but this option is not required.",
        "equivalent": 4884,
        "full_name": "Complex Analysis",
        "id": 4884,
        "lexographic": 8,
        "num": 317862,
        "online": false,
        "online_only": false,
        "prereq_string": "Multivariable Calculus",
        "prereqs": [
            [
                "2204"
            ]
        ],
        "semester": true,
        "short_name": "Complex Analysis",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "4919": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Computer Science",
        "coreq_string": "",
        "description": "Students study AI techniques in a variety of contexts with an emphasis on generalizing search algorithms.  Topics include graphs, heuristics, recursion, pruning, constraint solvers and games. Programming assignments include word ladders, navigating across Romania, map coloring, Sudoku, GHOST and Reversi. The programming language is Python.",
        "equivalent": 4919,
        "full_name": "Artificial Intelligence 1",
        "id": 4919,
        "lexographic": 2,
        "num": 319966,
        "online": false,
        "online_only": false,
        "prereq_string": "AP Computer Science A+ (Data Structures including APCS-A)",
        "prereqs": [
            [
                "6563"
            ]
        ],
        "semester": true,
        "short_name": "Artificial Intell1",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "4920": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Computer Science",
        "coreq_string": "",
        "description": "Students study AI techniques in a variety of contexts with an emphasis on knowledge representation. Topics include natural language processing, optimization and learning. Programming assignments include a semantic lexicon for English, N-queens and other local search, Tic-Tac-Toe and neural networks. The programming language is Python.",
        "equivalent": 4920,
        "full_name": "Artificial Intelligence 2",
        "id": 4920,
        "lexographic": 3,
        "num": 319967,
        "online": false,
        "online_only": false,
        "prereq_string": "Artificial Intelligence 1",
        "prereqs": [
            [
                "4919"
            ]
        ],
        "semester": true,
        "short_name": "Artificial Intell2",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "5110": {
        "ap": "ap",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students study the use of language for active communication, specifically: the ability to understand the spoken target language in both formal and conversational situations; the ability to express ideas accurately and resourcefully, both orally and in writing with reasonable fluency; the development of a vocabulary sufficient for reading newspaper and magazine articles, contemporary literature, and other writings; extensive training in the organization and writing of compositions; an in-depth review of grammar; and the study of chosen works by contemporary writers. Materials include recordings, films, newspapers, and magazines. Upon completion, students take the Prototype AP Russian Language and Culture exam.",
        "equivalent": 5110,
        "full_name": "Advanced Russian Language and Culture",
        "id": 5110,
        "lexographic": 0,
        "num": 546004,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "AP Russian Lang",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "5145": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop the ability to communicate about themselves and their immediate environment using simple sentences containing basic language structures.  This communication is evidenced in all four language skills - listening, speaking, reading and writing - with emphasis on the ability to communicate orally and in writing.  Students begin to explore and study the themes of Personal and Family Life, School Life, Social Life, and Community Life.  For middle school students, this credit becomes a part of the high school transcript, is included in the determination of the high school grade point average (GPA), and counts toward fulfilling the world languages requirement of the high school Advanced Studies diploma.  It also counts toward the total number of credits required for graduation.",
        "equivalent": 5145,
        "full_name": "Chinese 1",
        "id": 5145,
        "lexographic": 0,
        "num": 581000,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Chinese 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "5146": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to communicate orally and in writing.  They learn to function in real-life situations using more complex sentences and language structures.  They read material on familiar topics and produce short writing samples.  Students continue to explore as they study the themes of Home Life, Student Life, Leisure Time, and Vacation and Travel.",
        "equivalent": 5146,
        "full_name": "Chinese 2",
        "id": 5146,
        "lexographic": 1,
        "num": 582000,
        "online": false,
        "online_only": false,
        "prereq_string": "Chinese 1 or equivalency test",
        "prereqs": [
            [
                "5145"
            ]
        ],
        "semester": false,
        "short_name": "Chinese 2",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "5147": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students continue to develop and refine their proficiency in all four language skills - listening, speaking, reading, and writing - with emphasis on the ability to interact orally and in writing.  They communicate using more complex language structures on a variety of topics, moving from concrete to more abstract concepts.  At this level, students comprehend the main ideas of the authentic materials that they read and hear, and they are able to identify significant details when the topics are familiar.  Students gain a deeper understanding of the world around them while studying Rights and Responsibilities, Future Plans and Choices, Teen Culture, Environment, and Humanities.",
        "equivalent": 5147,
        "full_name": "Chinese 3",
        "id": 5147,
        "lexographic": 2,
        "num": 583000,
        "online": false,
        "online_only": false,
        "prereq_string": "Chinese 2 or equivalency test",
        "prereqs": [
            [
                "5146"
            ]
        ],
        "semester": false,
        "short_name": "Chinese 3",
        "skiptest": true,
        "summer": false,
        "weight": 0
    },
    "5149": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "World Languages",
        "coreq_string": "",
        "description": "Students develop more sophisticated communication skills in all four areas - listening, speaking, reading and writing - with emphasis on the ability to interact orally and in writing.  The authentic reading selections are emphasized at this level.  Students communicate using more complex language structures and express abstract ideas with reasonable fluency.  Students are able to create and listen with understanding to reports and presentations.  They are also able to describe, summarize and discuss selected upper level POS themes and topics.",
        "equivalent": 5149,
        "full_name": "Chinese 4",
        "id": 5149,
        "lexographic": 3,
        "num": 584000,
        "online": false,
        "online_only": false,
        "prereq_string": "Chinese 3 or equivalency test",
        "prereqs": [
            [
                "5147"
            ]
        ],
        "semester": false,
        "short_name": "Chinese 4",
        "skiptest": true,
        "summer": false,
        "weight": 0.5
    },
    "5453": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Students will be introduced to a variety of exciting opportunities to use artistic processes, learn to think conceptually and realize your potential as a creative and critical thinker in order to meet the challenges of modern living.  Explore personal interests while developing skills in the areas of drawing, painting, printmaking, ceramics sculpture, and digital media.  Course content includes art production, art appreciation, and studies in visual culture.",
        "equivalent": 5453,
        "full_name": "Art 1",
        "id": 5453,
        "lexographic": 0,
        "num": 912032,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Stud Art & Des 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "5457": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Students cultivate previously developed artistic knowledge and skills learned in Art 1. Explore new combinations and possibilities in the use of two-dimensional and three-dimensional media including technological applications.  Investigate contemporary topics as they relate to artistic expression and design. Ask questions, solve problems, create products and communicate ideas in innovative ways.  Course content includes art production, design thinking, art history and criticism, aesthetics, and studies in visual culture.",
        "equivalent": 5457,
        "full_name": "Art 2",
        "id": 5457,
        "lexographic": 1,
        "num": 913032,
        "online": false,
        "online_only": false,
        "prereq_string": "Art 1",
        "prereqs": [
            [
                "5453"
            ]
        ],
        "semester": true,
        "short_name": "Stud Art & Des 2",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "5475": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Students think creatively and solve visual problems to create expressive artworks using technology.  Develop expertise in the use of computers, scanners, and digital cameras for art making.  Use Adobe Photoshop, Adobe Illustrator, Bryce 3-D, and Adobe Flash in the areas of motion graphics/animation, graphic design, and digital imaging.  Learn to address the ethical issues concerning computer generated imagery.  No prior computer experience required.",
        "equivalent": 5475,
        "full_name": "Computer Graph 1",
        "id": 5475,
        "lexographic": 0,
        "num": 918032,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Computer Graph 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "5476": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Students will expand their knowledge in the application of computer hardware and software to create expressive art.  Solve complex visual problems in the areas of multimedia presentations, motion graphics/animation, graphic design, and digital imaging using Adobe Photoshop, Adobe Illustrator and Adobe Flash.  Students will prepare a final portfolio for evaluation.",
        "equivalent": 5476,
        "full_name": "Computer Graph 2",
        "id": 5476,
        "lexographic": 1,
        "num": 918132,
        "online": false,
        "online_only": false,
        "prereq_string": "Computer Graphics 1",
        "prereqs": [
            [
                "5475"
            ]
        ],
        "semester": true,
        "short_name": "Computer Graph 2",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "5478": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Students will explore and practice standard black and white photographic processes through the use of cameras, films, light effects, and application of basic darkroom techniques. They will also be introduced to digital photographic processes. Produce meaningful photographs that express ideas about experiences and observations of the world.  Study the history of photography and the work of well know photographers to inform art marking.  Develop a beginning portfolio.",
        "equivalent": 5478,
        "full_name": "Photography 1",
        "id": 5478,
        "lexographic": 0,
        "num": 919332,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Photography 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "5481": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            false,
            true,
            true
        ],
        "category": "Visual Arts",
        "coreq_string": "",
        "description": "Students expand on the study of black and white photography and digital processes to acquire and apply in-depth knowledge of photographic equipment, films, and specialized processes, including digital applications.  Investigate leading exponents, equipment, and techniques from an historical perspective.  Learn to critique and evaluate personal artwork and photographic works of others.  Examine photography and its relationship to other art forms.  Prepare a portfolio of meaningful artworks that demonstrate expressive content and quality of craftmanship.",
        "equivalent": 5481,
        "full_name": "Photography 2",
        "id": 5481,
        "lexographic": 1,
        "num": 919432,
        "online": false,
        "online_only": false,
        "prereq_string": "Photography 1",
        "prereqs": [
            [
                "5478"
            ]
        ],
        "semester": true,
        "short_name": "Photography 2",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "6184": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In this course, students learn and practice the language and processes of broadcast journalism and reporting. They develop an understanding of the role and responsibilities of broadcast journalists.",
        "equivalent": 6184,
        "full_name": "Broadcast Journalism 1",
        "id": 6184,
        "lexographic": 0,
        "num": 122000,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Broadcast Journ 1",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "6563": {
        "ap": "ap",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Computer Science",
        "coreq_string": "",
        "description": "This course is a standard 2nd semester college level course on algorithims and data structures in an object-oriented environment. The sorting algorithims studied include selection, insertion, merge, quick, and heap. The data structures studied include arrays, array lists, linked lists, stacks, queues, trees, sets, maps, and graphs. Additional topics include recursion, the Java Collections framework, Big-O analysis, and class design. The programming language is Java. Students taking this course should be independent thinkers able to spend a significant amount of time at a computer outside of class. Approximately 75% of the time is spent learning material that is above and beyond the material on the AP Computer Science A exam.",
        "equivalent": 6563,
        "full_name": "AP Computer Science A+",
        "id": 6563,
        "lexographic": 1,
        "num": 318561,
        "online": false,
        "online_only": false,
        "prereq_string": "Foundations in Computer Science",
        "prereqs": [
            [
                "6992"
            ]
        ],
        "semester": false,
        "short_name": "AP Computer Sci A+",
        "skiptest": true,
        "summer": false,
        "weight": 1.0
    },
    "6577": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In this course, students continue to learn and practice the language and processes of broadcast journalism and reporting. They develop an understanding of the role and responsibilities of broadcast journalists.",
        "equivalent": 6577,
        "full_name": "Broadcast Journalism 2",
        "id": 6577,
        "lexographic": 1,
        "num": 122012,
        "online": false,
        "online_only": false,
        "prereq_string": "Broadcast Journalism 1",
        "prereqs": [
            [
                "6184"
            ]
        ],
        "semester": false,
        "short_name": "Broadcast Journ 2",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "6578": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In this course, students expand their learning and practice the language and processes of broadcast journalism and reporting. They become proficient at producing the news while understanding of the role and responsibilities of broadcast journalists.",
        "equivalent": 6578,
        "full_name": "Broadcast Journalism 3",
        "id": 6578,
        "lexographic": 2,
        "num": 122013,
        "online": false,
        "online_only": false,
        "prereq_string": "Broadcast Journalism 2",
        "prereqs": [
            [
                "6577"
            ]
        ],
        "semester": false,
        "short_name": "Broadcast Journ 3",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "6581": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "This year-long social studies elective will examine the historical quest to understand nature, including human nature. From astronomy to zoology, we will study the methods and lives of individuals who have contributed to what we know or think we know. We will consider philosophy and psychology and, as much as possible, we will steer clear of topics typically emphasized in required courses. This course fulfills the 4th year social studies credit.",
        "equivalent": 6581,
        "full_name": "History Of Science",
        "id": 6581,
        "lexographic": 0,
        "num": "2996T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "History Of Science",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6587": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Mathematics",
        "coreq_string": "",
        "description": "This course is intended to highlight mathematical principles, concepts, and techniques that are often used in scientific applications and illustrate how these techniques are employed in the context of specific problems in physics, chemistry, and biology. Topics include mathematical modeling with differential equations, extensions of vector calculus to spherical and cylindrical coordinate systems, normal mode expansions and Fourier series, linear algebra, group theory, differential geometry, and applications of complex numbers in a variety of fields. Applications cover topics ranging from probability theory to interacting ecosystems to quantum systems. Some of the special functions found in mathematical physics, including Bessel functions, Legendre polynomials, the Gamma function and the Riemann Zeta function will also be discussed in the context of various physical applications. Most of the relevant mathematical and physical concepts will be presented in the class, but students are expected to have knowledge of basic calculus and basic physics.",
        "equivalent": 6587,
        "full_name": "Math Techniques",
        "id": 6587,
        "lexographic": 0,
        "num": 319862,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Math Techniques",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "6863": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            false
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "This is a team-taught, interdisciplinary survey course in American history and literature from the 16 century to the present. Students examine the interrelationships among art, literature, music, and architecture along with specific historic trends and events. The course focuses on the major themes and philosophies of our nation's history as well as on the men and women who created it. Although the reading load is lighter than an AP US History course, VA/US History provides a thorough survey of America's story with an emphasis on overall trends and events. Upon completion, students will take the SOL U.S./VA History end-of-course test. Students learn to assess historical materials, their relevance to a given interpretive problem, their reliability and their importance, and to weigh evidence and interpretations presented in historical scholarship while refining their language, learning, and communication skills.",
        "equivalent": 6863,
        "full_name": "US VA History",
        "id": 6863,
        "lexographic": 1,
        "num": "2360T1",
        "online": false,
        "online_only": false,
        "prereq_string": "World History and Geography 2",
        "prereqs": [
            [
                "6911"
            ]
        ],
        "semester": false,
        "short_name": "US VA History",
        "skiptest": false,
        "summer": true,
        "weight": 0.5
    },
    "6893": {
        "ap": "pre",
        "availability": [
            false,
            false,
            false,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "Geosystems at Thomas Jefferson was designed explicitly to exploit the prior science and mathematical preparation of the senior class and features an interdisciplinary curriculum designed as an analytical culminating science experience. Students use concepts from biology, chemistry, physics, and their full math curriculum together with newly learned information about the earth system to facilitate their understanding very complex real world issues such as global warming (both its chemistry and historical evidence), loss of biodiversity, thinning of the ozone layer, and El Nino. Throughout the year students address problems using technology such as ArcGIS (Geographic Information Systems software), Stella (modeling software), and image processing software, the same tools that professional scientists use. Upon completion of Geosystems, students will take the Virginia Earth Sciences standards of learning end-of-course test.",
        "equivalent": 6893,
        "full_name": "Geosystems",
        "id": 6893,
        "lexographic": 0,
        "num": "4220T1",
        "online": false,
        "online_only": false,
        "prereq_string": "Biology 1, Chemistry 1, and Physics 1",
        "prereqs": [
            ["6895", "6897", "6898"]
        ],
        "semester": false,
        "short_name": "Geosystems",
        "summer": true,
        "weight": 0.5
    },
    "6895": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            false,
            false,
            false
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "The honors level freshman Biology course at TJHSST is molecular based introductory course with emphasis on chemistry for biology students, cell biology, bioenergetics, DNA science, evolution, ecology, and human anatomy and physiology. The course is designed with two purposes in mind. First, it provides the content and skills foundation for the entire scientific program at the school. In particular, the Biology curriculum prepares students for the Advance Placement (AP) Biology course. Second, the course represents one element of IBET that links these distinctive disciplines so that scientific concepts, language arts, and engineering innovation are seamlessly woven together in a way that is realistic and relevant to students. As such, the Biology course demonstrates cohesive horizontal articulation (including the constraints of the unique integrated project work done by each team) among the various Biology classes, while also targeting vertical articulation in support of upper-class courses. Each IBET team requires the development of a year-long research project designed and conducted by students in small groups. Collaboration is stressed to prepare students for increased demands by industry for strong interpersonal skills as well as technical competencies. The Fairfax County Public Schools Family Life Education (FLE) instruction occurs at the end of the school year. Upon completion of Biology 1, students will take the Virginia Biology standards of learning end-of-course test.",
        "equivalent": 6895,
        "full_name": "Biology 1",
        "id": 6895,
        "lexographic": 0,
        "num": "4310T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Biology 1",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6897": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            false,
            false
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "Chemistry 1 focuses on investigating the world of matter and energy through critical inquiry, problem solving, and research. Due to its enabling roles in fields from the life sciences and agriculture to engineering, materials science, and nanotechnology, chemistry is often regarded as the central science. This unique centrality is emphasized through class dialogue, activities, and laboratory experiments in which students observe and analyze chemical systems in order to bolster conceptual understanding. As fundamentals are developed, students continue to deepen their grasp of the molecular basis of macroscopic properties and phenomena and examine principles and questions of increasing complexity. Upon completion of Chemistry 1, students will take the Virginia Chemistry standards of learning end-of-course test.",
        "equivalent": 6897,
        "full_name": "Chemistry 1",
        "id": 6897,
        "lexographic": 1,
        "num": "4410T1",
        "online": false,
        "online_only": false,
        "prereq_string": "Biology 1",
        "prereqs": [
            [
                "6895"
            ]
        ],
        "semester": false,
        "short_name": "Chemistry 1",
        "skiptest": false,
        "summer": true,
        "weight": 0.5
    },
    "6898": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            false
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "Physics 1 is a non-calculus based conceptually and mathematically rigorous first year university preparatory course. Laboratory-centered, the course exposes students to methods of scientific inquiry and elementary error analysis. Course design requires students to develop a solid background in the conceptual basis of physics as well strong critical thinking and problem solving skills. The course is a comprehensive treatment of the topics of mechanics, electricity and magnetism, and waves and oscillations. When time allows, other topics in thermodynamics or modern physics may be treated on an instructor-specific basis.",
        "equivalent": 6898,
        "full_name": "Physics 1",
        "id": 6898,
        "lexographic": 2,
        "num": "4510T1",
        "online": false,
        "online_only": false,
        "prereq_string": "Chemistry 1",
        "prereqs": [
            [
                "6897"
            ]
        ],
        "semester": false,
        "short_name": "Physics 1",
        "skiptest": false,
        "summer": true,
        "weight": 0.5
    },
    "6900": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            false,
            false,
            false
        ],
        "category": "English",
        "coreq_string": "",
        "description": "This required three-period block integrates instructional objectives of Biology, English 9, and Design and Technology. The IBET Program uses a process-oriented approach to help students establish connections across the disciplines and attain the objectives for each course. Student groups learn to collect data, conduct literature searches, and prepare publications and presentations through long-term project collaborations with private and governmental agencies. Separate grades are awarded for each course. The goal of the ninth-grade English program is to expose students to various forms of literature that will encourage them to make discoveries about themselves and the world around them. Through studying models of many genres, students sharpen their writing skills by producing their own analytic, creative, and scientific work. Students experience the processes used in writing, working in groups, reading, listening, speaking, and viewing. In each of these areas, they examine their experiences and knowledge. They produce cumulative projects often in the form of class presentations and performances. Components of the course include use of writing logs, participation in book talks, literary discussion groups, writing workshops, and groups formed for special projects.",
        "equivalent": 6900,
        "full_name": "English 9",
        "id": 6900,
        "lexographic": 0,
        "num": "1130T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "English 9",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6902": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            false,
            false
        ],
        "category": "English",
        "coreq_string": "",
        "description": "Humanities I (WHG II and English 10) is a one year interdisciplinary study of philosophy, literature, fine arts, and history to create an understanding of cultural developments in an historical context. Beginning with a foundational understanding of the world before 1500 C.E., the course focuses primarily on cultural developments from 1500 C.E. to the present. Students explore a variety of genres in reading and writing. In addition to refining research skills and habits of mind associated with the course curriculum, students have opportunities to incorporate learning in a variety of creative presentations.",
        "equivalent": 6902,
        "full_name": "English 10",
        "id": 6902,
        "lexographic": 1,
        "num": "1140T1",
        "online": false,
        "online_only": false,
        "prereq_string": "English 9",
        "prereqs": [
            [
                "6900"
            ]
        ],
        "semester": false,
        "short_name": "English 10",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6903": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            false
        ],
        "category": "English",
        "coreq_string": "",
        "description": "This course is a team-taught, interdisciplinary study of American history, literature and culture from pre-Columbian times to the present. Many of the assignments and activities in Humanities 2 are designed to provide teachers and students opportunities to explore relationships between the two subjects. The class focuses on specific historical and literary themes and events in American history emphasizing critical reading and writing, group work, and individual and group projects. Students not only learn about the American experience at a survey level, but also investigate primary source documents that give voice to the major ideas of each time period. These texts serve as a springboard for independent, ongoing research. In the English portion of this course, students study a variety of literary texts, including poetry, fiction, exposition, and drama. They discover and compare themes in these texts and use them as the basis for written analysis and discussion. Through varied and frequent writing assignments, students reinforce their understanding of purpose and audience, and develop their ability to control voice and tone. In addition, students study vocabulary, usage, dialect differences, language development and rhetorical principles.  Upon completion, students take the Reading and Writing SOL tests.\nNote: When paired with US History (not APUSH) this is (1150T2)",
        "equivalent": 6903,
        "full_name": "English 11",
        "id": 6903,
        "lexographic": 2,
        "num": "1150T1",
        "online": false,
        "online_only": false,
        "prereq_string": "English 10",
        "prereqs": [
            [
                "6902"
            ]
        ],
        "semester": false,
        "short_name": "English 11",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6905": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            false,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "English 12 Honors deepens and advances the curiculum of English 12. Students read and analyze a variety of literary texts, recognizing major forms and their stylistic elements. Using nonfiction texts, students will analyze and synthesize information to solve problems. Language study expands students' general and specialized vocabulary through speaking, listening, reading, and viewing. Writing includes the production of informational, expository, and persuasive/argumentative papers, logically organized demonstrating knowledgeable judgments, and effective conclusions. They also apply their oral communication skills to craft formal oral presentations and their listening skills to analyze the relationships among purpose, audience and content of presentations.",
        "equivalent": 6905,
        "full_name": "English 12 Hn",
        "id": 6905,
        "lexographic": 1,
        "num": "1160T1",
        "online": false,
        "online_only": false,
        "prereq_string": "English 11",
        "prereqs": [
            [
                "6903"
            ]
        ],
        "semester": false,
        "short_name": "English 12",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6911": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            false,
            false
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "Humanities I (WHG II and English 10) is a one year interdisciplinary study of philosophy, literature, fine arts, and history to create an understanding of cultural developments in an historical context. Beginning with a foundational understanding of the world before 1500 C.E., the course focuses primarily on cultural developments from 1500 C.E. to the present. Students explore a variety of genres in reading and writing. In addition to refining research skills and habits of mind associated with the course curriculum, students have opportunities to incorporate learning in a variety of creative presentations.",
        "equivalent": 6911,
        "full_name": "World Hist/geog 2",
        "id": 6911,
        "lexographic": 0,
        "num": "2221T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "World Hist/geog 2",
        "skiptest": false,
        "summer": true,
        "weight": 0.5
    },
    "6912": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "Divided into two halves, this course is an introduction to the broad field of anthropology. In the physical/biological half, the focus is human evolution and non-human primates such as monkeys and great apes. A visit to the primate collection of the National Zoo is standard. The second half is organized around the study of human society and culture. Through readings, class discussions, presentations, and videos, the class explores what it means to be human. Topics include: similarities and differences among cultures; social and economic characteristics; customs, traditions, taboos, and beliefs; and how anthropology, through its distinctive methods, can clarify our understanding of each other and ourselves. A variety of guest speakers working in the subfields of anthropology enrich the course, and depending on availability may include primatologists, forensic anthropologists, archaeologists, and ethnographers. Emphasis is placed on responsible participation in group and class activities such as team projects, class discussions, reading, writing, and research.",
        "equivalent": 6912,
        "full_name": "Anthro Studies",
        "id": 6912,
        "lexographic": 0,
        "num": "2374T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Anthro Studies",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6915": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "Psychology is the scientific study of behavior and mental processes. But everything psychological is simultaneously biological. Every thought, emotion and body movement has biological underpinnings. And yet, we are more than just a collection of neural networks. Our brains have consciousness. The brain seeks to understand itself. The brain somehow gives birth to the mind. TJ's psychology semester elective seeks to explore the connection between the brain and the mind. How important is the brain in shaping behavior? Why do we do what we do? Throughout the course, students will use approaches from a variety of psychological perspectives (social, developmental, evolutionary, cognitive, behavioral, psychoanalytic and biological) to explore this question.",
        "equivalent": 6915,
        "full_name": "Psych: Brain & Behavior",
        "id": 6915,
        "lexographic": 0,
        "num": "2900T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Psych: Brain & Beh",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6916": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "This course offers students an opportunity to investigate various philosophies and topics in western thought from the time of the earliest Greek philosophers to the present. The goal in this class is to further individual philosophical exploration and understanding by reflecting on the concepts proposed by philosophers of the past and critically analyzing how applicable those ideas are to individuals and society today. Students will examine philosophical methods and develop critical skills by writing and discussing philosophical arguments on selected topics and by writing their own philosophical statement. Students will also distinguish between systematic philosophical investigation and personal belief and opinion, and value the rich ideas and points of view on many issues, both classical and modern.",
        "equivalent": 6916,
        "full_name": "Inquiry Into Ideas",
        "id": 6916,
        "lexographic": 0,
        "num": "2950T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Inquiry Into Ideas",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6917": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Social Studies",
        "coreq_string": "",
        "description": "In this course, students examine the underlying belief systems and philosophies of the world's major religions. The goal in this class is to understand these belief systems, the nature of religion, and how those who hold these beliefs feel their religion accurately explains the world and reality. Students will also study primal religions, historical origins, and current religious trends, issues and topics in order to develop an appreciation and understanding of the diversity of responses mankind has made to fulfill its religious desires. A wide variety of speakers, films, and other source materials are used to support these goals. Major religions studied are Hinduism, Buddhism, Taoism, Confucianism and traditional Chinese religions, Judaism, Christianity, and Islam.",
        "equivalent": 6917,
        "full_name": "Religious Studies",
        "id": 6917,
        "lexographic": 0,
        "num": "2950T2",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Religious Studies",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6938": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            false,
            true
        ],
        "category": "English",
        "coreq_string": "",
        "description": "In this course, students advance their broadcast journalism skills by practicing communication skills in the community and in the media workplace. They become proficient at producing in-depth news packages and quality field reports. They master the rights and responsibilities of broadcast journalism.",
        "equivalent": 6938,
        "full_name": "Broadcast Journalism 4",
        "id": 6938,
        "lexographic": 3,
        "num": 122014,
        "online": false,
        "online_only": false,
        "prereq_string": "Broadcast Journalism 3",
        "prereqs": [
            [
                "6578"
            ]
        ],
        "semester": false,
        "short_name": "Broadcast Journ 4",
        "skiptest": false,
        "summer": false,
        "weight": 0
    },
    "6948": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "Students investigate the development of astronomy from the ideas of the ancients to modern technological exploration of our Solar System. The course focuses on the origin, dynamics, and physical characteristics of the members of the Solar System (Sun, planets, satellites, meteoroids, asteroids, and comets). Through a study of planetary geology, students will gain an appreciation for the interdisciplinary nature of astronomy.",
        "equivalent": 6948,
        "full_name": "Adv Astr Solar Sys",
        "id": 6948,
        "lexographic": 0,
        "num": "4260T4",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Adv Astr Solar Sys",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6949": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "Students investigate astronomy from the stellar and galactic realm. We begin with the physical properties of stars and stellar evolution how astronomers infer a star's origin and eventual demise. We progress to studies of galaxies, using the Milky Way as our standard for comparison. The Universe on a grand scale then becomes the topic for analysis as we discuss clusters of galaxies and cosmology the origin and evolution of the Universe.",
        "equivalent": 6949,
        "full_name": "Adv Astr Universe",
        "id": 6949,
        "lexographic": 0,
        "num": "4260T5",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Adv Astr Universe",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6950": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "This course was developed for any student with an inherent interest in the ocean. It is a one semester informational expedition into a vital but little known part of our world. The course will build on and expand knowledge gained in previous or concurrent science classes biology, chemistry, physics, and geosystems. It is a course designed with a global perspective to stimulate students thinking about and creating an appreciation for the marine environment. Students will study science as it applies to the world ocean, the vast diversity, structure and function of the ocean inhabitants, the ecosystems and delicate balances between biotic and abiotic factors, and the interaction of humans with the marine environment. Students will have the opportunity to participate in class discussions, labs, projects and field studies.",
        "equivalent": 6950,
        "full_name": "Adv Marine Biology",
        "id": 6950,
        "lexographic": 0,
        "num": "4320T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Adv Marine Biology",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6952": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "DNA Science 1 is a heavily lab based course in which students acquire the knowledge and skills necessary to perform basic molecular biology research. The course develops an understanding of critical concepts and techniques of recombinant DNA technologies in experimental biology.  DNA Science 1 topics include: 1) Foundational events of modern molecular biology 2)Biochemistry and cell biology of DNA 3) Gene expression applications for prokaryotes, stem cells, neuroscience, and cancer 4)Recombinant DNA 5)Gel electrophoresis 6)Restriction enzymes 7)DNA analysis and amplification techniques 8)Mutagenesis, selection, and microbial physiology;evolution and ecology applications 9)Bioinformatics related to molecular biology 10)Risk/reward of recombinant DNA techniques to humanity and the enviroment.  DNA Science 1 is a prerequisite for the Biotechnology Laboratory's Senior Research and Mentorship programs and DNA Science 2 is highly recommended for both.",
        "equivalent": 6952,
        "full_name": "DNA Science 1",
        "id": 6952,
        "lexographic": 2,
        "num": "4320T6",
        "online": false,
        "online_only": false,
        "prereq_string": "Chemistry 1",
        "prereqs": [
            [
                "6897"
            ]
        ],
        "semester": true,
        "short_name": "DNA Science 1",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6953": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "DNA Science 2 is highly recommended for all Biotechnology Senior Research Laboratory and Mentorship students. This course focuses on the biological basis of human inheritance and the human genome project, including its technological challenges and its implications for biology, ethics, law and society. Students will utilize and reinforce lab skills learned from DNA Science 1. The course is an ambitious laboratory based approach to learning research methods for eukaryotes such as humans, Arabidopsis (plants), yeast, Drosophila (fruit flies), C. elegans (nematodes) and cancer cells. Students will study methods including PCR design and analysis, Western blotting, use of antibodies to locate proteins in cells, cancer cell staining, mutation/transgenes and selection, proteomics, chromotagraphy, protein purification, bioinformatics analysis and more. Familiarity with these methods will allow students to address questions of interest during their senior lab in areas as diverse as neuroscience, ecology, stem cell research, cancer, HIV/vaccines and other hot topics in the life sciences.",
        "equivalent": 6953,
        "full_name": "DNA Science 2",
        "id": 6953,
        "lexographic": 3,
        "num": "4320T7",
        "online": false,
        "online_only": false,
        "prereq_string": "DNA Science 1",
        "prereqs": [
            [
                "6952"
            ]
        ],
        "semester": true,
        "short_name": "DNA Science 2",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6954": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "In this course, students will be exposed to many of the exciting new discoveries related to the brain and how it functions. The course is not intended to be an introduction to neurobiology (which is more appropriately addressed at the college level). Rather, it is intended to give students an opportunity to learn about such topics ranging from how memories are formed and stored to the mechanism of depression; from gender differences in brain structure and function to synesthesia (a condition whereby peoples senses get mixed up); from the causes of and treatments for Alzheimers disease to the effects of cocaine on the brain. The class modus operandi is similar to a graduate school seminar: students will lead and participate in discussions on specific topics, based on readings from the scientific literature. There is a heavy emphasis on the interpretation of data, analysis of methodology, and experimental design. Furthermore, creative thought is required for the discussions on the best path to take for future research.",
        "equivalent": 6954,
        "full_name": "Neurobiology",
        "id": 6954,
        "lexographic": 3,
        "num": "4320T8",
        "online": false,
        "online_only": false,
        "prereq_string": "AP Biology",
        "prereqs": [
            [
                "1382"
            ]
        ],
        "semester": true,
        "short_name": "Neurobiology",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "6956": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "This introduction to Organic Chemistry and Instrumental Analysis is designed for those students who plan to pursue careers in chemical sciences, biological sciences, engineering, or medicine. Students with interests in other sciences gain valuable experiences in dealing with sophisticated topics. The course is also designed to aid students in the development and generation of ideas for Senior Research. Topics include nomenclature, characterization, reactions, synthesis, and selected topics in biochemistry. The students will also be exposed to the theory, operation and data interpretation of chemical instrumentation such as infrared spectroscopy, UV-Vis spectroscopy, fluorescence, gas chromatography, refractometry, mass spectroscopy, nuclear magnetic resonance spectroscopy. Approximately one-third of the class time will be spent in the laboratory so students gain valuable hands-on experience.",
        "equivalent": 6956,
        "full_name": "Intro Org Chem 1",
        "id": 6956,
        "lexographic": 4,
        "num": "4420T4",
        "online": false,
        "online_only": false,
        "prereq_string": "AP Chemistry",
        "prereqs": [
            [
                "1394"
            ]
        ],
        "semester": true,
        "short_name": "Intro Org Chem 1",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "6958": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "Computational Physics is a post-AP course which needs knowledge of physics, mathematics and computer science. This course aimed at students to learn in solving physics problems through the creative synthetic process of computational methods. The course leads students to engage three or four computational physics methods: Classical Molecular Dynamics, Classical Monte Carlo, Hartree-Fock method, and First-principles method based on Density Functional Theory (DFT). Especially, students will use electronics structure methods to solve real-life problems. No prior experiences with advanced physics, such as quantum mechanics, are assumed but students have to have great interest in learning and problem solving in collaboration with their peers. This course will lay foundation for senior research on computational physics projects.",
        "equivalent": 6958,
        "full_name": "Computational Physics",
        "id": 6958,
        "lexographic": 3,
        "num": "4520T1",
        "online": false,
        "online_only": false,
        "prereq_string": "Physics 1",
        "prereqs": [
            [
                "6898"
            ]
        ],
        "semester": true,
        "short_name": "Computational Phys",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6964": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "A few years ago, scientists discovered that geckoes can cling to smooth surfaces through the use of Van der Waals interactions between fine hairs on the geckos feet and the surface in question. In 2004 a small company began advertising a new adhesive that relies on the principles learned from studying geckos feet. Bionanotechnology is the relatively new field that focuses on the interface between technology and very small biological systems. The course will be conducted primarily as a seminar, and students will read papers on how biological systems and processes could be adapted for use in todays society. They will be called upon to imagine unique but beneficial uses of adaptations of known biological processes. A good imagination will clearly be an advantage to students taking this course.",
        "equivalent": 6964,
        "full_name": "Bionanotechnology",
        "id": 6964,
        "lexographic": 2,
        "num": "4610T6",
        "online": false,
        "online_only": false,
        "prereq_string": "Chemistry 1",
        "prereqs": [
            [
                "6897"
            ]
        ],
        "semester": true,
        "short_name": "Bionanotechnology",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "6992": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Computer Science",
        "coreq_string": "",
        "description": "Students are introduced to the academic discipline of computer science with emphasis on problem solving using the current College Board computer language. At this time, the language is Java. The course introduces Object Oriented Programming (OOP) and uses an Objects first approach. Skills in defining, writing, and running computer programs on a windows based networked personal computer are developed. Students work with both mathematical and non-mathematical problems. Students will also be introduced to computer graphics, Graphical User Interfaces (GUI), data storage and data processing, boolean algebra, and computer number systems. No prior computer knowledge is needed. This course is usually offered during summer school and as summer self-study for those students who wish to place out of this introductory course and begin their computer science studies with Data Structures including APCS-A.",
        "equivalent": 6992,
        "full_name": "Foundations Of Computer Science",
        "id": 6992,
        "lexographic": 0,
        "num": "3184T1",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Foundations Comsci",
        "skiptest": false,
        "summer": true,
        "weight": 0.5
    },
    "6993": {
        "ap": "pre",
        "approval": false,
        "availability": [
            true,
            true,
            true,
            true
        ],
        "category": "Computer Science",
        "coreq_string": "",
        "description": "Accelerated Foundations of Computer Science is offered as differentiated instruction at Thomas Jefferson High School for Science and Technology. It is meant to be an introductory computer science course for students who know some computer science but not enough to pass the Placement Test into Data Structures including APCS-A. The course is noted by its instruction in both Python and Java computer languages, and its pace of instruction. It will cover more material at a faster pace than Foundations of Computer Science. In addition, it will cover a number of non-programming computer science topics. It will prepare students to take the second year course, Data Structures including APCS-A.",
        "equivalent": 6992,
        "full_name": "Accelerated Foundations Of Computer Science",
        "id": 6993,
        "lexographic": 0,
        "num": "3184T2",
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": false,
        "short_name": "Fnds Comp Sci Acc",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "9501": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "Students learn about Optical Systems and Nano-imaging Analysis through a semester long series of collaborative laboratory investigations. This course introduces students to core optical phenomenology through an extensive set of laboratory experiences and hands-on operating experience of several nano-imaging analysis instruments. The course introduces students to Geometric Optics, Scalar and Polarized Wave Optics, image formation in optical systems, the superposition principle, interference effects, microwave optics, fiber optics, lasers, and holography. Students make their own hologram, and design and build an optical instrument such as a classical telescopes, microscopes and polarizers. The course integrated nano-imaging analysis instruments, including atomic force microscope (AFM), scanning electron microscope (SEM), and scanning tunneling microscope (STM), etc. Students learn how to apply these instruments to biology, chemistry and condensed matter physics and materials sciences. This course will lay foundation for senior research on experimental Nano- physics and materials science projects.",
        "equivalent": 9501,
        "full_name": "Optical Systems",
        "id": 9501,
        "lexographic": 2,
        "num": "4520T8",
        "online": false,
        "online_only": false,
        "prereq_string": "Geometry HN or TJ Math 2",
        "prereqs": [
            [],
            [
                "10598"
            ]
        ],
        "semester": true,
        "short_name": "Optical Systems",
        "skiptest": false,
        "summer": false,
        "weight": 0.5
    },
    "9502": {
        "ap": "post",
        "approval": false,
        "availability": [
            false,
            false,
            true,
            true
        ],
        "category": "Science",
        "coreq_string": "",
        "description": "Electromagnetic interactions dominate the structure and behavior of systems on earth; from atomic to chemical to nano to biological to geological scales and beyond. 100% of the information humans receive about the world around them is encoded in and transmitted through the electromagnetic field. Building on the foundation of the strong AP Physics-C course, students extend their understanding of Space-Time, Electromagnetic fields and interactions during the first semester,; with an emphasis on dynamic electromagnetic fields and waves starting from Maxwell's Equations in differential and integral form. Einstein's conception of space-time, embodied in Special Relativity, is developed to produce a consistent description of electromagnetic fields, forces, and interactions. Classical electrodynamics, and classical wave optics are developed in a rigorous mathematical treatment. Quantum Mechanics is introduced after winter break in the physical context of Quantum Optics and finite-state systems which brings together fundamental quantum mechanics, electromagnetic fields, and the interaction of photons with matter,. The development includes contemporary research areas and modern applications of quantum mechanics including quantum entanglement, the quantum description of photo production and detection, select topics in solid state physics and nano technology. The last quarter of the course introduces basic concepts in Quantum Computing and Quantum Cryptography, with an attendant examination of fundamental quantum mechanics of entangled states and Bell's theorem. The course ends with a brief description of the structure and physical concepts of the fully relativistic quantum theory: Quantum Electrodynamics. This course is intended for students who enjoyed AP Physics-C and wish to understand the fundamental physics of space-time, electromagnetic fields, and quantum mechanics. Strong quantitative problem solving skills as demonstrated in AP Physics-C and advanced mathematics courses at TJ as well as an eagerness to learn through problem solving are requirements for success in this post-AP course.  Students should plan on spending a minimum of 6 hours per week on homework for the class.",
        "equivalent": 9502,
        "full_name": "Electrodynamics",
        "id": 9502,
        "lexographic": 4,
        "num": "4520T9",
        "online": false,
        "online_only": false,
        "prereq_string": "AP Physics C",
        "prereqs": [
            [
                "1408"
            ]
        ],
        "semester": false,
        "short_name": "Electrodynamics",
        "skiptest": false,
        "summer": false,
        "weight": 1.0
    },
    "9717": {
        "ap": "pre",
        "approval": false,
        "availability": [
            false,
            true,
            true,
            true
        ],
        "category": "Health & Physical Education",
        "coreq_string": "",
        "description": "Sports Medicine is offered as an elective course for high school students. The course was developed to introduce students to the field of sports medicine. Sports medicine is a broad profession that requires the cooperation of many allied health and medical professionals. This course has a strong focus on human anatomy and physiology, prevention of athletic related injuries, and basic first aid.\r\n\r\nStudents will also have the opportunity to become certified in CPR and first aid.",
        "equivalent": 9717,
        "full_name": "Sports Medicine",
        "id": 9717,
        "lexographic": 0,
        "num": 763032,
        "online": false,
        "online_only": false,
        "prereq_string": "",
        "prereqs": [],
        "semester": true,
        "short_name": "Sports Medicine",
        "skiptest": false,
        "summer": false,
        "weight": 0
    }
}